var program = [{"id":"1","title":"Opening Ceremony","tags":["track:Trackless events","type:Event"],"date":"2021-10-01","time":"19:45","loc":["Channel One (Twitch)"],"people":[{"id":"A0145","name":"Sakura Perez (moderator)"}],"desc":"Octocon's chair Raissa Perez welcomes you to our second virtual convention - and maybe she'll even tell you something about our plans for 2022..."},{"id":"2","title":"Closing Ceremony","tags":["track:Trackless events","type:Event"],"date":"2021-10-03","time":"18:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0145","name":"Sakura Perez (moderator)"}],"desc":"We bid farewell to another Octocon, and look forward to 2022."},{"id":"3","title":"Glasgow in 2024 Book Club: This Is How You Lose the Time War","tags":["track:Literature","type:Fan Chat"],"date":"2021-10-03","time":"15:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"A0033","name":"Noelle Jenda (moderator)"}],"desc":"This year's Octocon book club is hosted by the Glasgow in 2024 Worldcon bid. Up for discussion is the multi-award-winning novella This Is How You Lose the Time War by Amal El-Mohtar and Max Gladstone. "},{"id":"4","title":"Darren Shan: Ringmaster of the Macabre","tags":["track:Literature","type:Interview"],"date":"2021-10-03","time":"14:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0061","name":"Janet O'Sullivan (moderator)"},{"id":"M1016","name":"Darren Shan"}],"desc":"Global bestselling children's author Darren Shan has terrified us with zombies, ghosts, vampires and exotic spiders as well as the outright horror of being a teenager. Come and listen as he spins us a tale and answers questions about his books, what really scares him, and what drew him to a career in horror."},{"id":"5","title":"The Hitchhiker's Guide to the Irish Fan Scene","tags":["track:Fandom","type:Panel"],"date":"2021-10-01","time":"20:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0035","name":"Catherine Sharp (moderator)"},{"id":"A0058","name":"Legendgerry"},{"id":"A0061","name":"Janet O'Sullivan"},{"id":"A0179","name":"Róisín Loughran"},{"id":"A1101","name":"Brian Quigley"},{"id":"M1054","name":"Aaron Fever"}],"desc":"From the Emerald Garrison to the Celtic Throwdown, from DCAF (the Dublin Comics Arts Festival) and the Cupán Fae writers group to the USS CúChulain, Gaelcon and even Octocon itself, Ireland has a host of fan-run groups and events dedicated to celebrating and creating the things we love. Our panel of local fans tells us more about how to get involved."},{"id":"6","title":"We're in This Together Now: The Importance of Found Families","tags":["track:General","type:Panel"],"date":"2021-10-02","time":"11:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0035","name":"Catherine Sharp (moderator)"},{"id":"M1001","name":"Dan Abnett"},{"id":"M1002","name":"Nik Vincent-Abnett"},{"id":"M1012","name":"Amie Kaufman"}],"desc":"A gang of mismatched teens fighting supernatural horrors. A close-knit spaceship crew. Superheroes (and sometimes villains too) banding together against a common enemy. Whether they're hurtling around the universe or crossing forests and mountains on a quest together, the bonds built between companions and crew can be tighter than those between blood relatives. What do the found families we enjoy say about the relationships we find ourselves in and the things we create together in fandom?"},{"id":"7","title":"Titancon Presents: Writing Our North - Culture and Belonging in Northern Irish Literature","tags":["track:General","type:Panel"],"date":"2021-10-03","time":"17:00","loc":["Channel Two (Twitch)"],"people":[{"id":"A0077","name":"Samuel Poots (moderator)"},{"id":"A0029","name":"RB Kelly"},{"id":"M1023","name":"Graham Andrews"},{"id":"M1031","name":"Caroline Mullan"}],"desc":"Northern Ireland has proven fertile ground for the fantastic, from the young adult adventures of <em>Narnia<\/em> to the multi-species medical drama of <em>Sector General<\/em>. But what characterises N. Irish genre fiction, and how do its writers explore the unique blend of cultures and traditions found in Our Wee Country?  "},{"id":"8","title":"Found Family Fortunes","tags":["track:Trackless events","type:Comedy Panel"],"date":"2021-10-01","time":"22:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0004","name":"James Shields"},{"id":"A0017","name":"Tommy Ferguson"},{"id":"A0053","name":"Paul Carroll"},{"id":"A0054","name":"James Brophy"},{"id":"A0061","name":"Janet O'Sullivan"},{"id":"A0077","name":"Samuel Poots"},{"id":"M1073","name":"Ade Beattie"}],"desc":"We're back with another episode of our epic panel quiz, Found Family Fortunes, with your host James Brophy! This time the <a href=\"https:\/\/titancon.com\" target=\"_blank\">Titancon<\/a> family will be taking on the Octocon family to see who knows our audience the best."},{"id":"9","title":"Crime Narratives in Other Worlds","tags":["track:General","type:Panel"],"date":"2021-10-03","time":"12:00","loc":["Channel One (Twitch)"],"people":[{"id":"M1006","name":"Jack Fennell (moderator)"},{"id":"M1003","name":"Michael Carroll"},{"id":"M1021","name":"Aliette de Bodard"},{"id":"M1035","name":"Christopher J Garcia"}],"desc":"Murder. Blackmail. Theft. Fraud. Even in far and future worlds, we can't escape them or the institutions that police and punish them. Why are crime narratives central to so many science fiction and fantasy stories, and what makes them different to the crime tales set in the world we see around us?"},{"id":"10","title":"Defending the Villain","tags":["track:General","type:Panel"],"date":"2021-10-02","time":"14:00","loc":["Channel One (Twitch)"],"people":[{"id":"M1009","name":"Peadar Ó Guilín (moderator)"},{"id":"M1001","name":"Dan Abnett"},{"id":"M1002","name":"Nik Vincent-Abnett"},{"id":"M1005","name":"Joseph Elliott-Coleman"},{"id":"M1010","name":"Ruth Frances Long \/ Jessica Thorne"}],"desc":"Villains can be mere one-dimensional plot devices, something for our hero to punch. They can also be representative of wider societal issues, an evil in our world today that we are all capable of, or a mistake we could all make. We can hate them or we can see ourselves in them, but is villainy largely a matter of perspective? Can we still see someone as a villain when we know them as a whole person instead of just from the viewpoint of their victims?"},{"id":"11","title":"Howling Laughter: The Intersection of Comedy and Horror","tags":["track:General","type:Panel"],"date":"2021-10-03","time":"13:00","loc":["Channel Two (Twitch)"],"people":[{"id":"M1022","name":"Robert JE Simpson (moderator)"},{"id":"A0029","name":"RB Kelly"},{"id":"M1007","name":"Kim Newman"},{"id":"M1029","name":"Anthea West"},{"id":"M1068","name":"Dilman Dila"}],"desc":"Why is screaming so close to laughing, surprise so close to shock? Why does comedy so often fill the gaps in tales of horror? From ‘Abbott and Costello Meet Frankenstein’ through ‘Scream’ to ‘Happy Death Day’, these two great flavours of entertainment prove to be a winning combination time and time again. Are the audiences just here to see the juggling of the opposing forces of fear and joy, or is there a deeper truth to be found in how we deal with subjects too terrifying for the rational mind?"},{"id":"12","title":"How Not to Code Your Non-Humans","tags":["track:General","type:Panel"],"date":"2021-10-02","time":"21:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0079","name":"Faranae (moderator)"},{"id":"A0072","name":"Angeline B. Adams"},{"id":"A0146","name":"Kat Dodd"},{"id":"M1032","name":"Cheryl Morgan"},{"id":"M1050","name":"S.L. Dove Cooper"}],"desc":"Writers often use traits of neurodiverse, non-binary, queer or disabled people as blueprints for their aliens, robots and monsters, but don't allow their humans to share these characteristics. How can we build both human and non-human characters to exhibit a wide range of identities without resorting to mere ambiguous coding or else to using racist, sexist or other bigoted stereotypes?  "},{"id":"13","title":"I Used to be a Fan and That's OK","tags":["track:Fandom","type:Panel"],"date":"2021-10-03","time":"16:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0001","name":"MaryBrigid Turner (moderator)"},{"id":"A0061","name":"Janet O'Sullivan"},{"id":"M1017","name":"Gillian Polack"},{"id":"M1022","name":"Robert JE Simpson"},{"id":"M1038","name":"David Ferguson"}],"desc":"Many fans have needed to renegotiate their relationships with the books, shows and comics that helped define them, whether because the creators and contributors have lost their fans' respect, the stories and characters are out-of-date, or the fandom itself has turned to the bad. Can we ever reconcile our conflicted feelings, and should we even try?"},{"id":"14","title":"Anime 101: It’s Not All Magical Adventure, Harems and Waifus","tags":["track:Anime","type:Panel"],"date":"2021-10-03","time":"13:00","loc":["Channel One (Twitch)"],"people":[{"id":"M1004","name":"Ann Gry (moderator)"},{"id":"A0079","name":"Faranae"},{"id":"A0145","name":"Sakura Perez"},{"id":"M1034","name":"Christopher Hwang"},{"id":"M1048","name":"Sakuya"}],"desc":"Have weebs on Twitter been scaring you from trying out anime? Do anime avatars make you hit the block button faster than you can say “absolutely not”? Don’t worry, we’re here to help! Today we dig deeper into anime and its many wonderful variations."},{"id":"15","title":"Isekai: Why Doesn’t Anyone Want to Go Home Anymore?","tags":["track:Anime","type:Panel"],"date":"2021-10-02","time":"18:00","loc":["Channel Two (Twitch)"],"people":[{"id":"M1053","name":"Vanessa MacLaren-Wray (moderator)"},{"id":"A0079","name":"Faranae"},{"id":"A0145","name":"Sakura Perez"},{"id":"M1004","name":"Ann Gry"},{"id":"M1050","name":"S.L. Dove Cooper"}],"desc":"Getting transported to a new world has been a staple of anime for decades, but there’s been a boom in recent years. How did we go from falling into books to getting hit by trucks? What are the differences between early and current isekai, and what’s driving those differences? Our panelists will cross time and space discussing everything from Escaflowne, Re:Zero, Spirited Away, and beyond."},{"id":"16","title":"African Science Fiction: Reclaiming Our Voices","tags":["track:Literature","type:Panel"],"date":"2021-10-02","time":"18:00","loc":["Channel One (Twitch)"],"people":[{"id":"M1005","name":"Joseph Elliott-Coleman (moderator)"},{"id":"M1064","name":"Tobi\tOgundiran"},{"id":"M1066","name":"Yvette Lisa Ndlovu"},{"id":"M1068","name":"Dilman Dila"}],"desc":"When someone mentions Black science fiction, they are often thinking of Anglophone African-American and Black British writers. However, there has been an explosion of new writers from the African continent who are beginning to reclaim their voices and histories from colonial cultural damage. Our panel discusses the identities and traditions that contribute to the new wave of African science fiction."},{"id":"17","title":"Grand Designs: The Big House and the Small Tombs of Gothic Fiction","tags":["track:Literature","type:Panel"],"date":"2021-10-02","time":"12:00","loc":["Channel Two (Twitch)"],"people":[{"id":"A0077","name":"Samuel Poots (moderator)"},{"id":"M1008","name":"Maura McHugh"},{"id":"M1010","name":"Ruth Frances Long \/ Jessica Thorne"},{"id":"M1036","name":"Clare Foley"},{"id":"M1043","name":"Ian Moore"}],"desc":"The sinister castle or big house has been a staple of Gothic fiction since Horace Walpole launched the genre with The Castle of Otranto in 1764, continuing through the last two centuries, with abandoned spaceships playing a similar role in science fiction, the castles or castle-analogues almost becoming characters in the story. What do these once-grand but now decrepit mansions and their gardens signify? And what makes for a particularly memorable stay?"},{"id":"18","title":"The Fantasy Genre Before Lord of the Rings","tags":["track:Literature","type:Panel"],"date":"2021-10-02","time":"15:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0143","name":"Elaine McIonyn (moderator)"},{"id":"A0089","name":"Cora Buhlert"},{"id":"M1006","name":"Jack Fennell"},{"id":"M1041","name":"Dr Helen Conrad-O'Briain"}],"desc":"Tolkien popularised fantasy set in a fully realised secondary world with no direct link to our own. Yet there were authors working before The Lord of the Rings came to rule the demesne, including E.R. Eddison, Robert E. Howard and our own Lord Dunsany, whose books go in strange directions separate from those of Tolkien and his imitators. Join our panellists as they explore the work of these early fantasy writers."},{"id":"19","title":"The Gateway Fiction That Brought You Here","tags":["track:Literature","type:Panel"],"date":"2021-10-03","time":"11:00","loc":["Channel Two (Twitch)"],"people":[{"id":"A0001","name":"MaryBrigid Turner (moderator)"},{"id":"A0003","name":"Jean Bürlesk"},{"id":"A0029","name":"RB Kelly"},{"id":"M1009","name":"Peadar Ó Guilín"},{"id":"M1012","name":"Amie Kaufman"}],"desc":"Did you ride into fantasy upon the back of a dragon or climb in through a wardrobe? Were you enthralled by Dracula or terrified by IT? Who gave you your first glimpse of a ray gun or a rocket to Mars? There are as many paths to being an SFF fan as there are books in L-Space, and our panellists reveal the stories that opened the doors - and wormholes - for them."},{"id":"20","title":"Unboxing Genre: Perceptions of SFFH","tags":["track:Literature","type:Panel"],"date":"2021-10-02","time":"14:00","loc":["Channel Two (Twitch)"],"people":[{"id":"M1024","name":"Kathy Ayers (moderator)"},{"id":"A0001","name":"MaryBrigid Turner"},{"id":"A0032","name":"Deirdre Thornton"},{"id":"M1020","name":"Fabio Fernandes"},{"id":"M1027","name":"Conor Bredin"}],"desc":"How do we map the limits of genre? Publishers and marketers put books and readers into predetermined boxes of convenience, but how much do these artificial boundaries shape our reading choices and influence how works are perceived? Our panellists examine genre distinctions and the impacts they have on both readers and writers of science fiction, fantasy and horror."},{"id":"21","title":"Uncovering the Hidden Treasures of the Past","tags":["track:Literature","type:Panel"],"date":"2021-10-03","time":"15:00","loc":["Channel One (Twitch)"],"people":[{"id":"M1043","name":"Ian Moore (moderator)"},{"id":"A0032","name":"Deirdre Thornton"},{"id":"A0089","name":"Cora Buhlert"},{"id":"M1003","name":"Michael Carroll"},{"id":"M1032","name":"Cheryl Morgan"}],"desc":"Science fiction as a genre looks to the future, but authors of the past can still have a lot to say to us even though their work may have fallen out of print and become a distant memory. Why have some writers and works been consigned to the vaults of history while others have remained on the shelves, and what would our panel most like to see restored from the archives?"},{"id":"22","title":"A Solar Panel: Building a Hopeful Future","tags":["track:Science and Technology","type:Panel"],"date":"2021-10-03","time":"17:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0057","name":"Máire Brophy (moderator)"},{"id":"A0028","name":"Oisín McGann"},{"id":"A0033","name":"Noelle Jenda"},{"id":"M1042","name":"Harun Šiljak"},{"id":"M1053","name":"Vanessa MacLaren-Wray"}],"desc":"We all want to live in a future where massive solar panels in space use microwaves to beam down free sustainable power to our luxurious floating cities. Our panellists discuss the science and activism that can help move us on from our gas-guzzling oil-extracting unsustainable past and present."},{"id":"23","title":"Global Optimistic Futures","tags":["track:Science and Technology","type:Panel"],"date":"2021-10-02","time":"20:00","loc":["Channel Two (Twitch)"],"people":[{"id":"M1053","name":"Vanessa MacLaren-Wray (moderator)"},{"id":"A0028","name":"Oisín McGann"},{"id":"A0061","name":"Janet O'Sullivan"},{"id":"M1015","name":"Francesco Verso"},{"id":"M1020","name":"Fabio Fernandes"}],"desc":"We all come from different places, but we're united by one human trait: hope. But what are we actually hoping for? What are the building blocks of a better future and how are they shaped by their local environment? And what does science fiction across the world have to say about them?"},{"id":"24","title":"Not Your Grimdark Dystopia: Optimism in Sci-Fi and Fantasy","tags":["track:General","type:Panel"],"date":"2021-10-01","time":"21:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0053","name":"Paul Carroll (moderator)"},{"id":"A0220","name":"Kalin Nenov"},{"id":"M1015","name":"Francesco Verso"},{"id":"M1020","name":"Fabio Fernandes"},{"id":"M1050","name":"S.L. Dove Cooper"}],"desc":"Can we use our optimism and empathy to make our world better and learn to fight for what we believe in as well as against social and environmental injustice and inequality? Hopepunk and solarpunk look at how things can go right rather than just how they can go wrong. Our panellists discuss the kinds of ideas and futures explored in these subgenres."},{"id":"25","title":"Seeing the Magical Wherever You Are","tags":["track:Writing and Creating","type:Panel"],"date":"2021-10-03","time":"14:00","loc":["Channel Two (Twitch)"],"people":[{"id":"A0001","name":"MaryBrigid Turner (moderator)"},{"id":"M1009","name":"Peadar Ó Guilín"},{"id":"M1010","name":"Ruth Frances Long \/ Jessica Thorne"},{"id":"M1014","name":"Jo Zebedee"},{"id":"M1021","name":"Aliette de Bodard"}],"desc":"People crave explanations and when they aren't there we make our own. There are many places we go where the truth is obscured or lost to time but we can't help but tell the story of it: the door to nowhere on the side of a building, the regrowth of a cut down tree, the standing stones of cultures long gone. Mythology assembled from the pieces scattered at our feet. Join our esteemed writers as they discuss how the real world can seize an imagination."},{"id":"26","title":"Workers of the Worlds Unite: Labour Relations in Future Fiction","tags":["track:General","type:Panel"],"date":"2021-10-03","time":"12:00","loc":["Channel Two (Twitch)"],"people":[{"id":"M1043","name":"Ian Moore (moderator)"},{"id":"M1002","name":"Nik Vincent-Abnett"},{"id":"M1039","name":"Declan Meenagh"},{"id":"M1042","name":"Harun Šiljak"}],"desc":"How do you strike when your only way to leave the workplace is an airlock? How do you organise collective bargaining when you have to pay for air? Is the Guild of Starship Designers to blame for bridge consoles still blowing up in the 24th century? People have been writing about guilds and unions almost as long as they’ve been writing genre fiction, but will there be any striking differences in the future?"},{"id":"28","title":"A Clockwork Anime","tags":["track:Anime","type:Fan Chat"],"date":"2021-10-03","time":"11:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"A0079","name":"Faranae (moderator)"}],"desc":"You are stranded on a deserted island with, for some reason, the endless ability to watch precisely one anime franchise. Pick your poison. You can include manga as well if you want, even if you only use it for kindling."},{"id":"29","title":"Better to Remember or Replay?","tags":["track:Gaming","type:Fan Chat"],"date":"2021-10-02","time":"16:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"M1059","name":"Fona (moderator)"}],"desc":"When remastering old video games, developers often say that the experience they are trying to create is not the original game but how people remember it. Is the power of the video game experience really too much for us to be objective about? What games do we wish we could play again, and which still give us that buzz? What would we love to see remastered and what's just not worth it?"},{"id":"30","title":"Beyond D&D: TTRPGs Without Dragons or Dungeons","tags":["track:Gaming","type:Fan Chat"],"date":"2021-10-03","time":"13:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"A0058","name":"Legendgerry (moderator)"}],"desc":"From bank heists to betrayal in haunted houses, space panic to ocean exploration: roleplaying is so much more than Dungeons and Dragons. Join us to explore the wealth of variety across our tabletops."},{"id":"31","title":"How Do You Get Your Comics?","tags":["track:Comics","type:Fan Chat"],"date":"2021-10-03","time":"12:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"M1038","name":"David Ferguson (moderator)"}],"desc":"Much of the joy of comic books comes from being in the store, picking up that one that catches your eye, flicking through the pages to see the art, and then buying. But how did this work for people during and since lockdown? Has the way in which you get your comics changed?"},{"id":"32","title":"How Green is My Genre?","tags":["track:General","type:Fan Chat"],"date":"2021-10-03","time":"16:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"M1039","name":"Declan Meenagh (moderator)"},{"id":"A0146","name":"Kat Dodd"}],"desc":"As we have come to realise just how much our actions affect the world and environment around us, how has that affected how we view the genres we use for escapism? Have we changed our actions as consumers and our work as creators, or do we just want somewhere to escape to regardless of the real world outside?"},{"id":"33","title":"Ice Breaker (Saturday morning)","tags":["track:Trackless events","type:Fan Chat"],"date":"2021-10-02","time":"10:00","loc":["The Octagon (Zoom)"],"people":[{"id":"A0061","name":"Janet O'Sullivan"}],"desc":"We're all fans here together - come and get to know some of your fellow Octocon attendees! Warning: There may be shenanigans.\r\nSuitable for children but they must be logged into Zoom and accompanied by an adult."},{"id":"34","title":"Ice Breaker (Saturday evening)","tags":["track:Trackless events","type:Fan Chat"],"date":"2021-10-02","time":"20:00","loc":["The Octagon (Zoom)"],"people":[{"id":"A0017","name":"Tommy Ferguson"}],"desc":"We're all fans here together - come and get to know some of your fellow Octocon attendees! Warning: There may be shenanigans.\r\nSuitable for children but they must be logged into Zoom and accompanied by an adult."},{"id":"35","title":"No Mourners, No Funerals: Let's Chat Shadow and Bone","tags":["track:TV\/Film","type:Fan Chat"],"date":"2021-10-03","time":"14:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"A0035","name":"Catherine Sharp (moderator)"}],"desc":"Netflix's adaptation of Leigh Bardugo's Shadow and Bone provided drama, romance, peril, and a very cute goat. Join us to revel in the first season and look forward to the next, and talk about what other Young Adult fantasy and sci-fi works would make great TV series if handled with the same care."},{"id":"36","title":"Returning to Normal… But for Who?","tags":["track:Fandom","type:Fan Chat"],"date":"2021-10-02","time":"15:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"M1039","name":"Declan Meenagh (moderator)"},{"id":"A0035","name":"Catherine Sharp"}],"desc":"As the world returns to the so-called normalcy of in-person events, how can we keep the good parts of virtual conventions that allowed many to attend when disabilities, borders and long-distance travel may have previously kept them away? How do we avoid silencing those who have found their voice and hold onto those who found a more visible place in the community?"},{"id":"37","title":"The 2021 Hugo Finalists: Novel and Series","tags":["track:Literature","type:Fan Chat"],"date":"2021-10-02","time":"18:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"A0032","name":"Deirdre Thornton (moderator)"}],"desc":"This is probably the only year we'll ever get to discuss the finalists at Octocon before the awards are announced! This discussion is focused on the works that are finalists for Best Novel and Best Series: what we've already read, what we still really want to read, and what we think might win."},{"id":"38","title":"The Expansion of the Marvel Cinematic Universe","tags":["track:TV\/Film","type:Fan Chat"],"date":"2021-10-02","time":"14:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"A0146","name":"Kat Dodd (moderator)"}],"desc":"The Avengers saved the universe from Thanos, but what now? Disney's new streaming shows have given us a rich diversity of styles through which to view the MCU. Join us to discuss the upcoming tidal wave of new Marvel content while we compare our impressions and theories of the shows of the past year."},{"id":"39","title":"Where Can We Start to Help Our Environment?","tags":["track:Science and Technology","type:Fan Chat"],"date":"2021-10-02","time":"12:00","loc":["Round Table (via the Lobby\/Zoom)"],"people":[{"id":"A0037","name":"Jane  Routley (moderator)"}],"desc":"What can one person do to stand against a tidal wave? If all we can control in a chaotic environmental situation are our own responses, where are our efforts best spent to organise for a better future for each other and our environment? Come share your stories of local initiatives and personal changes in our discussion of how we can fight the fear of not knowing what to do."},{"id":"40","title":"Food in Fantasy","tags":["track:General","type:Talk"],"date":"2021-10-03","time":"12:00","loc":["The Octagon (Zoom)"],"people":[{"id":"M1017","name":"Gillian Polack"}],"desc":"Most writers have moved beyond serving up stew and more stew and yet more stew in fantasy novels. What types of food are we likely to see in fantasy these days, then? Does the food do more than feed weary travellers when questing? Gillian will talk about the food depicted in the novels of Australian writers and Irish writers. Because this is part of Gillian's research on how we depict culture in speculative fiction rather than part of her foodie dreams, there will probably be no recipes."},{"id":"41","title":"Disability and the Roots of Heroic Fantasy","tags":["track:Writing and Creating","type:Talk"],"date":"2021-10-02","time":"16:00","loc":["The Octagon (Zoom)"],"people":[{"id":"A0072","name":"Angeline B. Adams"}],"desc":"Why is Henry Cavill in “The Witcher” bigger than Superman? And why did Yennefer have to get rid of her disability? For the answers, we have to go back to the Father of Heroic Fantasy, Robert E. Howard. His Conan the Barbarian is the ultimate survivor, who walked away from his own crucifixion. We discover his origins in a mix of macho culture and concealed vulnerability, Texan tough guys and hidden narratives of disability."},{"id":"42","title":"Asexuality in Fantasy and Science Fiction: A Partial Study in Contrasts","tags":["track:General","type:Talk"],"date":"2021-10-03","time":"13:00","loc":["The Octagon (Zoom)"],"people":[{"id":"M1050","name":"S.L. Dove Cooper"}],"desc":"Though asexuality may seem like a relatively new phenomenon, the concept is as old as modern ideas of other queer identities. Science fiction and fantasy has always had room for asexual coding, though in somewhat different ways. Join us to take a look at some of the tropes found in early contemporary ace coding in fantasy and science fiction and how more recent books handle asexual themes."},{"id":"43","title":"Meet The New Dinosaurs of Jurassic World: Dominion","tags":["track:TV\/Film","type:Talk"],"date":"2021-10-02","time":"13:00","loc":["The Octagon (Zoom)"],"people":[{"id":"M1049","name":"Sean the Dino Guy"}],"desc":"\r\n\r\nWith the third and final installment of the Jurassic World movie series coming soon, we're going to have more kinds of dinosaurs than ever before. But who are these cool new dinos? Sean the Dino Guy will give us a sneak peek at the fantastic new creatures that will stomp their way onto our cinema screens next year, and reveal fascinating facts about some old favourites. \r\nIf you love dinosaurs and blockbuster movies, this is the talk for you!"},{"id":"44","title":"Plants in Spaaace","tags":["track:Science and Technology","type:Talk"],"date":"2021-10-02","time":"14:00","loc":["The Octagon (Zoom)"],"people":[{"id":"M1030","name":"Carol Connolly"}],"desc":"A history of humanity's determination to garden in an almost impossible environment."},{"id":"45","title":"Chat with Aliette de Bodard","tags":["track:Trackless events","type:Guest Chat"],"date":"2021-10-02","time":"18:00","loc":["Oval Table (via the Lobby\/Zoom)"],"people":[{"id":"M1021","name":"Aliette de Bodard"}],"desc":"Sign-up required."},{"id":"46","title":"Chat with Dan Abnett","tags":["track:Trackless events","type:Guest Chat"],"date":"2021-10-03","time":"13:00","loc":["Oval Table (via the Lobby\/Zoom)"],"people":[{"id":"M1001","name":"Dan Abnett"}],"desc":"Sign-up required."},{"id":"47","title":"Chat with Gillian Polack","tags":["track:Trackless events","type:Guest Chat"],"date":"2021-10-02","time":"13:00","loc":["Oval Table (via the Lobby\/Zoom)"],"people":[{"id":"M1017","name":"Gillian Polack"}],"desc":"Sign-up required."},{"id":"48","title":"Chat with Jo Zebedee","tags":["track:Trackless events","type:Guest Chat"],"date":"2021-10-03","time":"11:00","loc":["Oval Table (via the Lobby\/Zoom)"],"people":[{"id":"M1014","name":"Jo Zebedee"}],"desc":"Sign-up required."},{"id":"50","title":"Chat with Michael Carroll","tags":["track:Trackless events","type:Guest Chat"],"date":"2021-10-02","time":"14:00","loc":["Oval Table (via the Lobby\/Zoom)"],"people":[{"id":"M1003","name":"Michael Carroll"}],"desc":"Sign-up required."},{"id":"51","title":"Chat with Peadar Ó Guilín","tags":["track:Trackless events","type:Guest Chat"],"date":"2021-10-02","time":"16:00","loc":["Oval Table (via the Lobby\/Zoom)"],"people":[{"id":"M1009","name":"Peadar Ó Guilín"}],"desc":"Sign-up required."},{"id":"52","title":"Chat with Ruth Frances Long \/ Jessica Thorne","tags":["track:Trackless events","type:Guest Chat"],"date":"2021-10-03","time":"12:00","loc":["Oval Table (via the Lobby\/Zoom)"],"people":[{"id":"M1010","name":"Ruth Frances Long \/ Jessica Thorne"}],"desc":"Sign-up required."},{"id":"53","title":"Chat with Fabio Fernandes","tags":["track:Trackless events","type:Guest Chat"],"date":"2021-10-03","time":"15:00","loc":["Oval Table (via the Lobby\/Zoom)"],"people":[{"id":"M1020","name":"Fabio Fernandes"}],"desc":"Sign-up required."},{"id":"54","title":"Reading: Aliette de Bodard","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"15:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1021","name":"Aliette de Bodard"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"55","title":"Reading: Damien Larkin","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"12:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1037","name":"Damien Larkin"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"56","title":"Reading: Dan Abnett","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"15:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1001","name":"Dan Abnett"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"57","title":"Reading: Gareth Hanrahan","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"12:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1019","name":"Gareth Hanrahan"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"58","title":"Reading: Gillian Polack","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"11:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1017","name":"Gillian Polack"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"59","title":"Reading: Jack Fennell","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"14:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1006","name":"Jack Fennell"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"60","title":"Reading: Jean Bürlesk","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"12:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"A0003","name":"Jean Bürlesk"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"61","title":"Reading: Jo Zebedee","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"13:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1014","name":"Jo Zebedee"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"62","title":"Reading: Joseph Elliott-Coleman","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"13:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1005","name":"Joseph Elliott-Coleman"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"63","title":"Reading: Juliet E McKenna","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"13:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"A0023","name":"Juliet E McKenna"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"65","title":"Reading: Nik Vincent-Abnett","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"16:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1002","name":"Nik Vincent-Abnett"}],"desc":" &nbsp;   &nbsp;   &nbsp;"},{"id":"66","title":"Reading: Peadar Ó Guilín","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"12:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1009","name":"Peadar Ó Guilín"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"67","title":"Reading: Pete Mullineaux","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"16:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1045","name":"Pete Mullineaux"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"68","title":"Reading: RB Kelly","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"14:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"A0029","name":"RB Kelly"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"69","title":"Reading: Russell A Smith","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"14:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"A0005","name":"Russell A Smith"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"70","title":"Reading: Ruth Frances Long \/ Jessica Thorne","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"16:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1010","name":"Ruth Frances Long \/ Jessica Thorne"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"71","title":"Reading: Fabio Fernandes","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"14:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1020","name":"Fabio Fernandes"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"72","title":"Reading: Otherworlds NI","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"20:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"A0072","name":"Angeline B. Adams"},{"id":"A0077","name":"Samuel Poots"},{"id":"A0181","name":"Sarah Murray"},{"id":"A0192","name":"Gary McKay"},{"id":"M1047","name":"Remco van Straten"}],"desc":"Otherworlds NI is a group of SFF writers based in (or with links to) Northern Ireland.\r\n\r\nWeb: <a href=\"https:\/\/realotherworldsni.wordpress.com\/\" target=\"_blank\">realotherworldsni.wordpress.com<\/a>\r\nTwitter: <a href=\"https:\/\/twitter.com\/sci_ni\" target=\"_blank\">@sci_ni<\/a>"},{"id":"73","title":"History as Inspiration","tags":["track:Writing and Creating","type:Panel"],"date":"2021-10-02","time":"16:00","loc":["Channel Two (Twitch)"],"people":[{"id":"A0026","name":"Brian Nisbet (moderator)"},{"id":"A0003","name":"Jean Bürlesk"},{"id":"M1010","name":"Ruth Frances Long \/ Jessica Thorne"},{"id":"M1017","name":"Gillian Polack"},{"id":"M1068","name":"Dilman Dila"}],"desc":"Five thousand years of recorded human history (give or take) has been more than enough to inspire countless writers to develop alternate timelines, transport well-known tales to the far future, and carry pieces of our history into their own fantastical worlds. Our panel discusses the many ways in which we can revise or reinvent historical events, people and settings to create new stories."},{"id":"74","title":"Horror on the Page","tags":["track:Writing and Creating","type:Panel"],"date":"2021-10-02","time":"16:00","loc":["Channel One (Twitch)"],"people":[{"id":"M1019","name":"Gareth Hanrahan (moderator)"},{"id":"M1007","name":"Kim Newman"},{"id":"M1008","name":"Maura McHugh"},{"id":"M1029","name":"Anthea West"},{"id":"M1070","name":"Gabriela Houston"}],"desc":"Jump scares, dripping gore, unsettling creaks and moans, and even dead silence: all staples of horror films but difficult to recreate on the page. Our panel of writers and artists discuss how to translate human fears into prose and comics while maintaining the suspense and atmosphere."},{"id":"75","title":"How Has Covid-19 Changed Creativity and Creative Processes?","tags":["track:Writing and Creating","type:Panel"],"date":"2021-10-03","time":"10:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0028","name":"Oisín McGann (moderator)"},{"id":"M1002","name":"Nik Vincent-Abnett"},{"id":"M1019","name":"Gareth Hanrahan"},{"id":"M1021","name":"Aliette de Bodard"},{"id":"M1075","name":"Elaine Lithgow"}],"desc":"During the Covid-19 pandemic and lockdowns, many of us relied on books, TV shows, comics and games to help us both pass the time and keep us grounded. But what impact did the pandemic have on the people who create our art and entertainment? Our panel of creators discuss the challenges and changes that came with such strange and unusual times."},{"id":"76","title":"Imposter Syndrome: If It Wasn't for That Pesky Self-Doubt...","tags":["track:Writing and Creating","type:Panel"],"date":"2021-10-02","time":"17:00","loc":["Channel Two (Twitch)"],"people":[{"id":"A0053","name":"Paul Carroll (moderator)"},{"id":"A0005","name":"Russell A Smith"},{"id":"M1003","name":"Michael Carroll"},{"id":"M1026","name":"Sarah Bevan"},{"id":"M1048","name":"Sakuya"}],"desc":"Outside pressure to meet others' expectations can intensify or conflict with the voice in your head that tells you to be humble about your creative achievements or else that you're just not good enough anyway. How can we learn to balance confidence and doubt to overcome the fear of being unmasked as an imposter?"},{"id":"77","title":"The Art and Craft of Illustration","tags":["track:Writing and Creating","type:Panel"],"date":"2021-10-02","time":"13:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0054","name":"James Brophy (moderator)"},{"id":"A0028","name":"Oisín McGann"},{"id":"M1026","name":"Sarah Bevan"},{"id":"M1056","name":"Leeann Hamilton"}],"desc":"Whether you read comics or picture books, play video and board games, or simply watch TV, you are surrounded by the work of professional illustrators. Our panel of artists discuss what goes into the art that wraps around every storytelling experience, as well as the variety of jobs which have influenced their styles and careers."},{"id":"78","title":"The Pen is Mighty: Writing Fight Sequences","tags":["track:Writing and Creating","type:Panel"],"date":"2021-10-02","time":"19:00","loc":["Channel Two (Twitch)"],"people":[{"id":"M1037","name":"Damien Larkin (moderator)"},{"id":"A0023","name":"Juliet E McKenna"},{"id":"A0146","name":"Kat Dodd"},{"id":"M1014","name":"Jo Zebedee"},{"id":"M1047","name":"Remco van Straten"}],"desc":"A clear, readable and compelling action sequence is difficult enough to create when you have a team of martial artists working it out between live bodies; what hope does a single writer have alone against the most insidious of foes, the blank page? Join us as we talk to the creators who woke up and chose violence as they explain how to connect the punches when writing an action scene."},{"id":"79","title":"Iconic Spaceships","tags":["track:Science and Technology","type:Panel"],"date":"2021-10-03","time":"16:00","loc":["Channel Two (Twitch)"],"people":[{"id":"M1044","name":"Karina Steffens (moderator)"},{"id":"A0054","name":"James Brophy"},{"id":"M1001","name":"Dan Abnett"},{"id":"M1025","name":"Edmond Barrett"},{"id":"M1056","name":"Leeann Hamilton"}],"desc":"From the TARDIS to the X-Wing, Mass Effect's Normandy to the Royal Manticoran Navy, sci-fi is replete with eye-catching spaceships. What do the panelists think makes a great design, from the bridge to engineering and beyond, and is an iconic design really necessary for a great story? And how do you make a spaceship feel like home?"},{"id":"80","title":"Access to the Infinite Budget: Own Voices in Comics","tags":["track:Comics","type:Panel"],"date":"2021-10-02","time":"15:00","loc":["Channel Two (Twitch)"],"people":[{"id":"A0053","name":"Paul Carroll (moderator)"},{"id":"M1051","name":"Tríona Farrell"},{"id":"M1056","name":"Leeann Hamilton"},{"id":"M1062","name":"Daniella Bella"}],"desc":"When other mediums won't give you the budget, comics are right there to be used to tell stories beyond gatekeepers. A panel of LGBTQI+ creators discuss the positive stories of own voices storytelling and the tales they would tell if they didn’t have a budget."},{"id":"81","title":"Around the World in 80 Pictures ","tags":["track:Comics","type:Panel"],"date":"2021-10-02","time":"11:00","loc":["Channel Two (Twitch)"],"people":[{"id":"M1048","name":"Sakuya (moderator)"},{"id":"A0089","name":"Cora Buhlert"},{"id":"M1004","name":"Ann Gry"},{"id":"M1034","name":"Christopher Hwang"}],"desc":"Whether you call them bandes dessinées, historietas, fumetti, manga or comics, stories told by pictures in a sequence have a long history and a global appeal. Regional traditions can influence each other through publishing styles and cultural ideas, and in this panel we'll take a sightseeing tour through the shared history of comics."},{"id":"82","title":"RPG: The Conrunners and the Chairperson's Pints","tags":["track:Gaming","type:Scheduled Game"],"date":"2021-10-02","time":"10:00","loc":["Games Rooms (Discord)"],"people":null,"desc":"A game for up to six hassled con runners (13+). Hosted by <a href=\"https:\/\/gaelcon.com\" target=\"_blank\">Gaelcon<\/a>.\r\n\r\nDisaster has struck the Con, several disasters really, and you as the con committee are the ones to fix it. Your Con Chair has had to step in and run a event, and without their guiding hand the event is starting to break down.\r\n\r\nSee the <a href=\"https:\/\/2021.octocon.com\/programme\/tabletop-games\/\" target=\"_blank\">Octocon programme page<\/a> for full info. Sign-ups required."},{"id":"83","title":"RPG: Salvage","tags":["track:Gaming","type:Scheduled Game"],"date":"2021-10-03","time":"14:00","loc":["Games Rooms (Discord)"],"people":null,"desc":"A cinematic horror game using the Alien RPG System, for four to five players (16+). Hosted by <a href=\"https:\/\/gaelcon.com\" target=\"_blank\">Gaelcon<\/a>.\r\n\r\nThe focus is on telling a fun and interesting story in the style of the Alien films, so it’s likely to be highly lethal. CW for horror, general dread, body-horror and gory violence.\r\n\r\nSee the <a href=\"https:\/\/2021.octocon.com\/programme\/tabletop-games\/\" target=\"_blank\">Octocon programme page<\/a> for full info. Sign-ups required."},{"id":"84","title":"Dungeons and Decolonisation","tags":["track:Gaming","type:Panel"],"date":"2021-10-02","time":"12:00","loc":["Channel One (Twitch)"],"people":[{"id":"M1062","name":"Daniella Bella (moderator)"},{"id":"A0109","name":"Dav Waldron"},{"id":"M1019","name":"Gareth Hanrahan"},{"id":"M1055","name":"Declan Doody"},{"id":"M1063","name":"Esther MacCallum-Stewart"}],"desc":"The original win condition of D&D was amassing amazing loot or sometimes just surviving the adventure. Now we quest for character fulfillment, and to meet new NPCs and gain experience from them. But while player parties are often embracing new paradigms and shedding the inherently colonial nature of the base material, are we seeing an equally enlightened view coming through the official publications?"},{"id":"85","title":"The Hills We Walked in Lockdown","tags":["track:Gaming","type:Panel"],"date":"2021-10-03","time":"11:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0025","name":"Paul Anthony Shortt (moderator)"},{"id":"A0026","name":"Brian Nisbet"},{"id":"M1004","name":"Ann Gry"},{"id":"M1063","name":"Esther MacCallum-Stewart"},{"id":"M1069","name":"Casey Explosion"}],"desc":"We adventured with Zelda in Hyrule, made homes in Animal Crossing, and blew up bases in Fortnite. Our team of gamers discuss the digital worlds we explored while we couldn't leave the house."},{"id":"86","title":"Therapeutic Games","tags":["track:Gaming","type:Panel"],"date":"2021-10-03","time":"15:00","loc":["Channel Two (Twitch)"],"people":[{"id":"A0109","name":"Dav Waldron (moderator)"},{"id":"A0020","name":"Quinn Clancy"},{"id":"A0077","name":"Samuel Poots"},{"id":"M1058","name":"Marc McCluskey"}],"desc":"When we don't know what to do next, games can provide simple, achievable objectives when the world provides none. When we feel alone, we can find companionship and friendship by figuring out how to play through a scenario together as a group. Games both tabletop and electronic are a wonderful way for us all to find escape when the world doesn't have a manual, provides no waypoint and won't even give us a castle to head to. Join us as we discuss the mental health benefits of all forms of gaming."},{"id":"88","title":"Consciousness and Ways to Reach It","tags":["track:Science and Technology","type:Panel"],"date":"2021-10-02","time":"20:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0054","name":"James Brophy (moderator)"},{"id":"M1004","name":"Ann Gry"},{"id":"M1045","name":"Pete Mullineaux"},{"id":"M1061","name":"Julian West"}],"desc":"Early sci-fi writers sought to define consciousness. Shirow Masamune asks what separates us from the machines when we become machines; Becky Chambers asks if our tools are sapient if they examine life beyond their task. Scientists grapple to find the origins of consciousness, while academics struggle to see the source of the light behind their own eyes. We take a look at some of the ways consciousness is defined and how they stack up against the theories presented in science fiction."},{"id":"89","title":"Orbital Tidy Towns Committee","tags":["track:Science and Technology","type:Comedy Panel"],"date":"2021-10-02","time":"22:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0054","name":"James Brophy (moderator)"},{"id":"A0001","name":"MaryBrigid Turner"},{"id":"A0004","name":"James Shields"},{"id":"A0005","name":"Russell A Smith"},{"id":"A0109","name":"Dav Waldron"},{"id":"M1039","name":"Declan Meenagh"},{"id":"M1053","name":"Vanessa MacLaren-Wray"}],"desc":"A dhaoine uaisle,\r\nI would like to welcome you, one and all to The Upper Middle Lower Orbit Area Community Forum. Our committee of distinguished guests will judge the humorous suggestions submitted for your entertainment and the betterment of our orbital community. If you have a suggestion yourself on the topic of how our world can be improved please feel free to get in touch,\r\nAs always, \r\nIs mise le mass equals density times volume, \r\nGobnait O'Lughnasa\r\n\r\n"},{"id":"90","title":"Reboot Challenge","tags":["track:TV\/Film","type:Comedy Panel"],"date":"2021-10-03","time":"10:00","loc":["Channel Two (Twitch)"],"people":[{"id":"A0054","name":"James Brophy (moderator)"},{"id":"A0005","name":"Russell A Smith"},{"id":"A0020","name":"Quinn Clancy"},{"id":"A0058","name":"Legendgerry"},{"id":"A0159","name":"Kaaron Warren"},{"id":"M1003","name":"Michael Carroll"}],"desc":"In a world of our childhoods being sold back to us, is there no limit to what will be pulled out of the trash heap of history? Join us for pitches large and small that will seek to reawaken your fandom heart without stirring you up to a violent backlash, as judged by Michael Carroll."},{"id":"91","title":"The Resurgence of Fantasy on TV","tags":["track:TV\/Film","type:Panel"],"date":"2021-10-02","time":"10:00","loc":["Channel One (Twitch)"],"people":[{"id":"M1025","name":"Edmond Barrett (moderator)"},{"id":"A0023","name":"Juliet E McKenna"},{"id":"A0025","name":"Paul Anthony Shortt"},{"id":"M1044","name":"Karina Steffens"},{"id":"M1047","name":"Remco van Straten"}],"desc":"One thing is for sure, the Witcher is being pelted with coins right now. What has allowed fantasy in all its forms to be produced now in a way that other shows couldn't match in years past? Is it just the locations and visual effects or do we have a better understanding of the material and what viewers are looking for? Are we writing better for television and streaming? And now that winter is over, where will you be tossing your coins next?"},{"id":"92","title":"The TV-ification of Film","tags":["track:TV\/Film","type:Panel"],"date":"2021-10-02","time":"13:00","loc":["Channel Two (Twitch)"],"people":[{"id":"M1004","name":"Ann Gry (moderator)"},{"id":"A0029","name":"RB Kelly"},{"id":"M1007","name":"Kim Newman"},{"id":"M1022","name":"Robert JE Simpson"},{"id":"M1028","name":"Anne-Louise Fortune"}],"desc":"How did making original films just become about setting up a sequel? So much of what we watch now feels like pilots for TV shows that never get made, all being thrown at the screen in the hope of creating instant fans for an ongoing multimedia brand instead of just making one good thing and then if that works, making another. Join us as we explore the negatives and positives of these strange new worlds that have birthed thousands of orphaned fans and many hashtag campaigns."},{"id":"93","title":"What Star Trek Means to Me","tags":["track:TV\/Film","type:Panel"],"date":"2021-10-02","time":"21:00","loc":["Channel Two (Twitch)"],"people":[{"id":"A0025","name":"Paul Anthony Shortt (moderator)"},{"id":"A0109","name":"Dav Waldron"},{"id":"M1037","name":"Damien Larkin"},{"id":"M1057","name":"Linda Butler"},{"id":"M1059","name":"Fona"}],"desc":"It’s lived for over 50 years and prospered throughout. Its new frontier has been a home for many different groups of people from across fandom and the globe all for whom it has meant very different things: racial and sexual representation, freedom from religious oppression, being able to see the humanity in the other, and why we should care for our fellow humans. Join us in the big tent aboard the Enterprise as we share unique perspectives in Infinite Diversity in Infinite Combinations. "},{"id":"94","title":"Comics Will Save Your Life","tags":["track:Comics","type:Panel"],"date":"2021-10-02","time":"17:00","loc":["Channel One (Twitch)"],"people":[{"id":"A0058","name":"Legendgerry (moderator)"},{"id":"M1001","name":"Dan Abnett"},{"id":"M1051","name":"Tríona Farrell"},{"id":"M1054","name":"Aaron Fever"}],"desc":"Comics play many positive roles in people's lives, as therapy, as community, as a social space, as a means for creative exploration. Jack “The King” Kirby once famously said “Comics will break your heart.” Is that still true or is it only true if you read comments on YouTube videos? Join us as we share the love we found in loving comics."},{"id":"95","title":"Shelly Bond and the Secrets of Comics Editing","tags":["track:Comics","type:Interview"],"date":"2021-10-02","time":"19:00","loc":["Channel One (Twitch)"],"people":[{"id":"M1003","name":"Michael Carroll (moderator)"},{"id":"M1013","name":"Shelly Bond"}],"desc":"Shelly Bond's editing career includes a 22-year run at DC Comics' Vertigo line and the creation of Black Crown, IDW's 'indie record label' imprint that merged music and comics. As well as her work on Sandman, Lucifer, Clean Room, Fables and Kid Lobotomy, she's also known for the Hey, Amateur and Insider Art anthologies, and her recent successful Kickstarter: Filth and Grammar: The Comic Editor’s Secret Handbook. Join us as she shares industry stories and insights."},{"id":"96","title":"Reading: Kaaron Warren","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"11:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"A0159","name":"Kaaron Warren"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"97","title":"Reading: Conor Bredin","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"15:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1027","name":"Conor Bredin"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"99","title":"Splattermania","tags":["track:Gaming","type:Scheduled Game"],"date":"2021-10-02","time":"14:00","loc":["Games Rooms (Discord)"],"people":[{"id":"M1058","name":"Marc McCluskey"}],"desc":"Splattermania is an all-ages, sensory friendly DnD royal rumble brought to you by Fingal Libraries. Experienced players only, 13+.\r\n\r\nNo death saves, no monsters, and no end of level bad guy. Twenty level 1 characters enter the ring one at a time and battle to the death separately or in teams. Last player standing wins. \r\n\r\nSee the <a href=\"https:\/\/2021.octocon.com\/programme\/tabletop-games\/\" target=\"_blank\">Octocon programme page<\/a> for full info. Sign-ups required."},{"id":"101","title":"Make Your Own Tentacle Tiara","tags":["track:Crafting","type:Workshop"],"date":"2021-10-03","time":"16:00","loc":["The Octagon (Zoom)"],"people":[{"id":"M1065","name":"Sara Felix"}],"desc":"Queen of Tiara Tuesdays, Sara Felix, brings you the opportunity to make your very own spectacular tentacular tiara! All you need is some card and glue, and a sprinkling of creativity. All ages, sign-ups required."},{"id":"102","title":"Challenge LEGO®","tags":["track:Crafting","type:Workshop"],"date":"2021-10-02","time":"15:00","loc":["The Octagon (Zoom)"],"people":[{"id":"A0004","name":"James Shields"}],"desc":"Whether you're a first time LEGO creator, or a master builder, grab a box of your favourite construction bricks and prepare to stretch your imagination with a series of building challenges set by expert builder James Shields. No particular parts are required, and there are no wrong solutions. It's just about having fun.\r\n\r\nSign-ups required. Suitable for all ages and abilities.\r\n\r\nLEGO® is a registered trademark of the LEGO Group, who do not authorise, sponsor or endorse this event."},{"id":"103","title":"Open Source Fan Stuff - How Can I Help?","tags":["track:Science and Technology","type:Workshop"],"date":"2021-10-02","time":"17:00","loc":["The Octagon (Zoom)"],"people":[{"id":"A0004","name":"James Shields"},{"id":"M1039","name":"Declan Meenagh"}],"desc":"Lots of people volunteer to write software and give it away for free. Open Source runs the Internet and we use it every day. So how do cons make use of open source software and how can you get involved? If you can write code, the answer is obvious, but even if you don’t, there's something for you. So roll up those sleeves and jump right in to building the tools that bring you the cons you love, as we take you through the projects used and give practical examples of how you can get involved."},{"id":"104","title":"Writing the Novel You Didn't Start in Lockdown","tags":["track:Writing and Creating","type:Workshop"],"date":"2021-10-03","time":"14:00","loc":["The Octagon (Zoom)"],"people":[{"id":"A0146","name":"Kat Dodd"}],"desc":"Did you mean to write a novel during lockdown because you suddenly had the time? Perhaps you even started one! But then it didn’t happen... Kat Dodd is here to tell you it’s not too late!\r\nThe workshop covers the process of preparing and planning your novel, as well as navigating the world of Writer's Block and the messiness of time when you don’t have any. Suitable for writers with any level of experience; perfect for those who want to learn how to get started and maintain momentum.\r\n\r\n\r\n\r\n"},{"id":"105","title":"How to Get Started Writing Comic Scripts","tags":["track:Comics","type:Workshop"],"date":"2021-10-03","time":"10:30","loc":["The Octagon (Zoom)"],"people":[{"id":"A0053","name":"Paul Carroll"}],"desc":"Drawing on his experiences in the Irish indie comics scene and the production of Turning Roads, Paul Carroll shares his insight into the craft of writing for comics.\r\nYou'll leave with an understanding of scripts and formats, the rules of film and storytelling and how they apply to comics, and the different roles of creators in comics, as well as advice on approaching other creators and releasing comics in digital and print formats, plus a template for pitching short comics to anthologies."},{"id":"106","title":"Make Your Own Crocheted Octo","tags":["track:Crafting","type:Workshop"],"date":"2021-10-02","time":"11:30","loc":["The Octagon (Zoom)"],"people":[{"id":"A0001","name":"MaryBrigid Turner"},{"id":"A0146","name":"Kat Dodd"}],"desc":"Join us as we teach you how to crochet your very own Octo! You will need about 25g of yarn (dk if possible, but scrap yarn will do) and a crochet hook between 3mm and 5mm or one to match the weight of the yarn you use. A basic knowledge of crochet is appreciated but not required as our pattern is suitable for beginners. We will provide you in advance with a copy of our Octo pattern which has been created and very kindly donated for our use by Octocon regular Kat Dodd. "},{"id":"107","title":"Reading: Jane Routley","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"11:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"A0037","name":"Jane  Routley"}],"desc":"&nbsp;&nbsp;&nbsp;"},{"id":"108","title":"Book Launch: Cupán Fae","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"18:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"A0020","name":"Quinn Clancy"},{"id":"A0053","name":"Paul Carroll"},{"id":"A0146","name":"Kat Dodd"}],"desc":"Cupán Fae launches their latest anthology, <em>Fierce: A Hopepunk Anthology<\/em>.\r\n\r\nCupán Fae is the caffeine-filled home away from home for writers in Ireland to discuss current projects, create writing prompts, workshop problematic plots and provide psychological support for characters with three minds of their own and a battle axe to grind. "},{"id":"109","title":"Friday Night Social","tags":["track:Trackless events","type:Event"],"date":"2021-10-01","time":"21:00","loc":["The Lobby (Zoom)"],"people":null,"desc":"Hang out with other Octocon attendees in breakout spaces off the Zoom Lobby and on Discord in #Main-Hall and #the-bar."},{"id":"110","title":"Saturday Night Social","tags":["track:Trackless events","type:Event"],"date":"2021-10-02","time":"21:00","loc":["The Lobby (Zoom)"],"people":null,"desc":"Hang out with other Octocon attendees in breakout spaces off the Zoom Lobby and on Discord in #Main-Hall and #the-bar."},{"id":"111","title":"Reading: Calder Szewczak","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"19:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1072","name":"Calder Szewczak"}],"desc":"                      "},{"id":"112","title":"Reading: Patricia Jackson","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"17:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1071","name":"Patricia Jackson"}],"desc":"   &nbsp;   &nbsp;   &nbsp;"},{"id":"113","title":"Octocon Dead Dog Party","tags":["track:Trackless events","type:Event"],"date":"2021-10-03","time":"20:00","loc":["The Lobby (Zoom)"],"people":null,"desc":"Usually at the end of Octocon, we'd gather in the hotel lobby and bar on Sunday evening, and then in the Porterhouse on Monday, to catch up with all the fun of the weekend and with friends old and new that we didn't get a chance to talk to earlier. Join us on Zoom instead to do just that, with a guaranteed comfy seat!"},{"id":"114","title":"Reading: Ginger Smith","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"16:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"A0256","name":"Ginger Smith"}],"desc":"          "},{"id":"115","title":"Reading: Sarah J. Daley","tags":["track:Trackless events","type:Reading"],"date":"2021-10-02","time":"17:30","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"A0253","name":"Sarah J. Daley"}],"desc":" &nbsp;   &nbsp;   &nbsp;"},{"id":"116","title":"Reading: Stephen Deas","tags":["track:Trackless events","type:Reading"],"date":"2021-10-03","time":"17:00","loc":["The Library (via the Lobby\/Zoom)"],"people":[{"id":"M1074","name":"Stephen Deas"}],"desc":"          "},{"id":"117","title":"Upcoming Events","tags":["track:Trackless events","type:Event"],"date":"2021-10-03","time":"18:15","loc":["Main Stage (Discord)"],"people":null,"desc":"Come find out what's on what's next for SFF fans in Ireland and beyond!"}];
var people = [{"id":"A0001","name":["MaryBrigid Turner"],"prog":["13","19","20","25","89","106"],"bio":"Originally from NZ, MaryBrigid has been an avid bookworm, and fan of SFFH of all types from an early age. She currently helps mould young minds and creates future panelists running the Children's section at Hodges Figgis, Ireland's oldest Bookstore. MaryBrigid is also a member of the Octocon programme team, and currently serving as Membership officer on the Octocon committee. ","links":[]},{"id":"A0003","name":["Jean Bürlesk"],"prog":["19","60","73"],"bio":"Jean Bürlesk is a storyteller. He writes, he reads, he acts, he makes jokes nobody understands. He would sing and dance, but he has no sense of rhythm or melody. Sometimes he still sings and dances. As a Luxembourger and a lover of words, he expresses himself in five recognizable languages, as well as the usual nonsense. His debut short story collection <em>The Pleasure of Drowning<\/em> won the Prix d’Encouragement de la Fondation Servais 2019 and he was awarded a Chrysalis Award at Eurocon 2020. \n\nWeb: <a href=\"https:\/\/jeanburlesk.wixsite.com\/jeanburlesk\" target=\"_blank\">jeanburlesk.wixsite.com\/jeanburlesk<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/jburlesk\" target=\"_blank\">@jburlesk<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/Jean-Bürlesk-109469590513703\/\" target=\"_blank\">Jean-Bürlesk-109469590513703<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp2028b9de88798bf3e1a90c3e8ce5317d.jpg"}},{"id":"A0004","name":["James Shields"],"prog":["8","89","102","103"],"bio":"James has been involved in fandom and conventions since the early 1990s. He has helped organise many conventions in Ireland and abroad, including Octocon, P-Con, Shamrokon (Eurocon), Eastercons and Worldcons. He has also been involved in fanzines, fan clubs and fan funds. He is also a fan of LEGO and will attempt to include it in convention programmes at every opportunity.\n[Octocon programme note: We're usually happy to let him succeed!]","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppdcc7663b0ec4e6649c053b22e24db8c3.png"}},{"id":"A0005","name":["Russell A Smith"],"prog":["69","76","89","90"],"bio":"Author of the urban fantasy series, <em>The Grenshall Manor Chronicles<\/em>, and a newer urban fantasy universe explored first in the upcoming <em>The Elementals<\/em> anthology, Russell is additionally a presenter on the Brave New Words podcast, historian, licensed time traveller, serial convention volunteer, gamer and pop culture enthusiast. Still spends far too much time watching videos on cats, wrestling and cars he will never own.\n\nWeb: <a href=\"https:\/\/projectshadowlondon.com\/\" target=\"_blank\">projectshadowlondon.com\/<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/RASmithPSL\" target=\"_blank\">@RASmithPSL<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp6de5103c8ec3469d98214dc88f1ed5ba.png"}},{"id":"A0017","name":["Tommy Ferguson"],"prog":["8","34"],"bio":"&nbsp; ","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp243be02b9d7fe38d9ddbbecd6fee383d.jpg"}},{"id":"A0020","name":["Quinn Clancy"],"prog":["86","90","108"],"bio":"&nbsp;","links":[]},{"id":"A0023","name":["Juliet E McKenna"],"prog":["63","78","91"],"bio":"Juliet E McKenna is a British fantasy author living in the Cotswolds, UK. Loving history, myth and other worlds since she first learned to read, she has written fifteen epic fantasy novels so far. Her debut, <em>The Thief's Gamble<\/em>, began <em>The Tales of Einarinn<\/em> in 1999, followed by <em>The Aldabreshin Compass<\/em> sequence, <em>The Chronicles of the Lescari Revolution<\/em>, and <em>The Hadrumal Crisis<\/em> trilogy. <em>The Green Man’s Heir<\/em> was her first modern fantasy rooted in British folklore in 2018, followed by <em>The Green Man’s Foe<\/em> and <em>The Green Man’s Silence<\/em>, all from Wizard’s Tower Press. 2021 sees the publication of <em>The Green Man’s Challenge<\/em>. She writes and comments on book trade issues, has served as a judge for major genre awards, reviews for magazines, and writes diverse shorter stories enjoying forays into dark fantasy, steampunk and SF. She has also written murder mysteries set in ancient Greece as J M Alvey. There are other interesting projects in hand, but she can’t talk about those just yet…\n\nWeb: <a href=\"https:\/\/julietemckenna.com\" target=\"_blank\">julietemckenna.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/JulietEMcKenna\" target=\"_blank\">@JulietEMcKenna<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp29c5f57605879fbe0e8eeb4298f07409.jpg"}},{"id":"A0025","name":["Paul Anthony Shortt"],"prog":["85","91","93"],"bio":"Paul Anthony Shortt believes in magic and monsters. In ghosts and fairies. The creatures that lurk under the bed and inside the closet. The things that live in the dark, and the heroes who stand against them. Above all, he believes that stories have the power to change the world, and the most important stories are the ones which show that monsters can be beaten.\nPaul’s work includes the <em>Memory Wars<\/em> Trilogy and the <em>Lady Raven<\/em> Series.\n\nTwitter: <a href=\"https:\/\/twitter.com\/PAShortt\" target=\"_blank\">@PAShortt<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/paulanthonyshortt\/\" target=\"_blank\">paulanthonyshortt<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp7ca7c933233a6c25a8a717ee0f410deb.jpg"}},{"id":"A0026","name":["Brian Nisbet"],"prog":["73","85"],"bio":"Brian Nisbet started running running gaming (Leprecon, Gaelcon, K2) and SF conventions in Ireland in the mid-90s. In 1998 he got involved in the International Discworld Convention, held in the UK, and went on to chair it twice in 2010 & 2012. He co-chaired Shamrokon, the 2014 Eurocon.Since then he's mostly been on the committees of Worldcons (Helsinki, San Jose, Dublin, Washington DC, Chicago) or Worldcon bids (Glasgow in 2024) in a variety of roles.He's been a huge fan of fantasy, sci-fi and gaming for over 30 years and he's so looking forward to all the things to come!\n\nTwitter: <a href=\"https:\/\/twitter.com\/natural20\" target=\"_blank\">@natural20<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp196e4667f74eb8065c715ac4c62b5575.png"}},{"id":"A0028","name":["Oisín McGann"],"prog":["22","23","75","77"],"bio":"Oisín McGann was born in Dublin and spent his childhood there and in Drogheda, County Louth. He studied at Ballyfermot Senior College and Dun Laoghaire School of Art and Design, and went on to work in illustration, design and film animation, later moving to London to work as an art director and copy writer in advertising.<br>He has since become one of Ireland’s most prolific and best-known writer-illustrators, and has produced dozens of books for all levels of reader, including twelve novels. He is the author of the Mad Grandad books, <em>Headbomz: Wreckin' Your Head<\/em> (in association with the ISPCC), and novels such as <em>Race the Atlantic Wind<\/em>, <em>The Gods and Their Machines<\/em> and <em>The Wildenstern Saga<\/em>. His latest books are <em>We Want Our Park Back<\/em>, a picture book for Green-Schools, and <em>A Short, Hopeful Guide to Climate Change<\/em>, a non-fiction book in association with Friends of the Earth, released in May 2021. He is the illustrator of Jason Byrne’s Onion O’Brien series, the latest of which is <em>The Secret Scientist<\/em>.<br>He is a winner of the European Science Fiction Society Award, CBI's Children's Choice Award and has been shortlisted for numerous other awards, including the Waterstones Childrens’ Book Prize in the UK, le Grand Prix de l'Imaginaire in France and Locus Magazine's Best First Novel Award in the US. He is married with three children, two dogs and a cat, and lives somewhere in the Irish countryside, where he won’t be heard shouting at his computer.\n\nTwitter: <a href=\"https:\/\/twitter.com\/OisinMcGann\" target=\"_blank\">@OisinMcGann<\/a>\nInstagram: <a href=\"https:\/\/instagram.com\/oisinmcgann\" target=\"_blank\">@oisinmcgann<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp6f2e89f6689cea9c5abb23150b29d49f.jpg"}},{"id":"A0029","name":["RB Kelly"],"prog":["7","11","19","68","92"],"bio":"RB Kelly is an author and film theorist. Her debut novel, <a href=\"http:\/\/www.newconpress.co.uk\/info\/book.asp?id=154&amp;referer=Catalogue\" target=\"_blank\"><em>The Edge of Heaven<\/em><\/a>, is published by <a href=\"http:\/\/www.newconpress.co.uk\/info\/book.asp?id=154&amp;referer=Catalogue\" target=\"_blank\">NewCon Press<\/a> and was shortlisted for the <a href=\"https:\/\/clarkeaward.com\/\" target=\"_blank\">Arthur C Clarke Award<\/a>. The sequel will be published in 2022. Her short stories can be found in publications from around the world, including <a href=\"http:\/\/www.newconpress.co.uk\/info\/book.asp?id=184&amp;referer=Hp\" target=\"_blank\">The Best of British Science Fiction<\/a>, <a href=\"https:\/\/aurealis.com.au\/\" target=\"_blank\"\">Aurealis<\/a>, and <a href=\"https:\/\/andromedaspaceways.com\/\" target=\"_blank\">Andromeda Spaceways Magazine<\/a>. She has a PhD in film studies and, with film historian Robert JE Simpson, co-runs CinePunked, an organisation dedicated to bridging the gap between film fandom and film theory.\n\nWeb: <a href=\"http:\/\/www.rbkelly.co.uk\/\" target=\"_blank\">www.rbkelly.co.uk<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/r_b_kelly\" target=\"_blank\">@r_b_kelly<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/RachaelKellyWriter\" target=\"_blank\">RachaelKellyWriter<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp14f6f7445514bc118b2b4c1f7ce594ed.jpg"}},{"id":"A0032","name":["Deirdre Thornton"],"prog":["20","21","37"],"bio":"Librarian (yes, Ook) and avid reader, a lot of variety mostly fantasy, who has lots of opinions. Also knits.","links":[]},{"id":"A0033","name":["Noelle Jenda"],"prog":["3","22"],"bio":"Noelle grew up on a mixed diet of Star Trek, Jane Austen and Anne McCaffrey. The next logical step was a doctorate degree in solar astrophysics. Now she works as a modeller on the national electricity grid and dabbles in sci-fi writing. She spends her early mornings creating character-driven stories. A lady of extremes, she loves the immediate gratification of flash-fiction, as well as getting lost in a novel-length work.\nNoelle has always been interested in environmental matters, starting with the first paper recycling campaign in her university back in the 1990’s (back when we tossed away all our paper, imagine!). Her current passions include her electric car and bringing more biodiversity to her GAA club.\nShe also is a fan of attending and helping to run sci-fi conventions – anyone for Glasgow in 2024?\n\nTwitter: <a href=\"https:\/\/twitter.com\/NellJenda\" target=\"_blank\">@NellJenda<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp1bbd73554d6b29e66c0c07a54018d8e5.jpg"}},{"id":"A0035","name":["Catherine Sharp"],"prog":["5","6","35","36"],"bio":"Technical writer by day, fiction writer by night, and always a passionate lover of SF and fantasy (and cake, caffeine and kittens), Catherine’s first Octocon was in 2012. In 2013 she offered herself up on the Octocon altar of volunteering and moderation, and hasn’t looked back. She’s much less terrified this year to be in charge of programme for the second online Octocon.\n\nTwitter: <a href=\"https:\/\/twitter.com\/CSharpWords\" target=\"_blank\">@CSharpWords<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp462b3b7e682f43d31b47505348901d00.jpg"}},{"id":"A0037","name":["Jane  Routley"],"prog":["39","107"],"bio":"Fantasy and Science Fiction writer Jane Routley's 7th book <em>Shadow in the Empire of Light<\/em> is out now from Rebellion Publishing in epub and audiobook. She has published 6 books, 5 as herself and one as Rebecca Locksley, and won two Aurealis Awards for Best Fantasy Novel for the novels <em>Fire Angels<\/em> and <em>Aramaya<\/em> respectively. Her short stories have been widely anthologized and read on the ABC.\nJane was a judge for the recent Australian Role Playing Industry Awards. She has had a variety of careers, including fruit picker and occult librarian and she lived in Germany and Denmark for a decade. Now she works on the railways in Melbourne and is a keen climate activist. Her greatest ambition is to see an erupting volcano.\n\nWeb: <a href=\"http:\/\/www.janeroutley.com\" target=\"_blank\">www.janeroutley.com<\/a>","links":[]},{"id":"A0053","name":["Paul Carroll"],"prog":["8","24","76","80","105","108"],"bio":"Paul Carroll is a writer and comic creator from Dublin. His work primarily focuses on the extraordinary, be that through magic, science or just downright chaotic. He is a founding member of both Limit Break Comics and Cupán Fae, Dublin-based creative groups.<br>His obsessions include tea, foxes and spreadsheets.\n\nWeb: <a href=\"http:\/\/paulcarrollwriter.com\" target=\"_blank\">paulcarrollwriter.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/writeranonymous\" target=\"_blank\">@writeranonymous<\/a>\nFacebook: <a href=\"https:\/\/facebook.com\/paulcarrollwriter\" target=\"_blank\">paulcarrollwriter<\/a>\nInstagram: <a href=\"https:\/\/instagram.com\/pcarrollwriter\" target=\"_blank\">@pcarrollwriter<\/a>\n\n","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppaf63d2d87585c083c0c08104671a55ef.jpg"}},{"id":"A0054","name":["James Brophy"],"prog":["8","77","79","88","89","90"],"bio":"A photographer and graphic designer based in Dublin, James has also worked in Visual effects and film development while writing materials and making art for Octocon on and off for the last 20 years.\n\nTwitter: <a href=\"https:\/\/twitter.com\/jamesfbrophy\" target=\"_blank\">@jamesfbrophy<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp63d4cbb6b3782ba1619a5e6dd73cdd81.png"}},{"id":"A0057","name":["Máire Brophy"],"prog":["22"],"bio":"Máire Brophy writes fantasy fiction about orcs and goblins. Her first book <em>After the World<\/em> was published in 2018 with a sequel out next year. When she's not writing, she works with researchers to help develop and express their ideas, and do more research. She's an avid player of Dungeons and Dragons, a neophyte Lego builder and an eater of cake. It's possible her dog is in charge of her instagram account.\n\nWeb: <a href=\"https:\/\/mairebrophy.com\" target=\"_blank\">mairebrophy.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/MaireBro\" target=\"_blank\">@MaireBro<\/a>\n","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppbf0ff0d7b614bdd404e998ea8d42a077.png"}},{"id":"A0058","name":["Legendgerry"],"prog":["5","30","90","94"],"bio":"Gerry Mc Evoy is a National Game Writer Award Winner and the European admin for the Vintage Role Playing Games group (not OSR affiliated), and runs the Irish conventions listing site <a href=\"https:\/\/cons.ie\" target=\"_blank\">Cons.ie<\/a>, He also writes Sci-fi and Fantasy, runs a near daily Interactive Fiction game on Twitter and is a former world martial arts champion.  He's the sort of guy who reads the Mountains of Madness campaign, thinks what this needs is the cast of Muppets Treasure Island and then actually writes it. (Best Scenario Warpcon 2020)<br>The funny part about this bio is people are going to chide him about the other things he does that he's neglected to mention.\n\nTwitter: <a href=\"https:\/\/twitter.com\/legendgerry\" target=\"_blank\">@legendgerry<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp71030d586c0cca588b5dafeb6125215f.jpg"}},{"id":"A0061","name":["Janet O'Sullivan"],"prog":["4","5","8","13","23","33"],"bio":"Janet read much too much, much too young and never stopped. She has been involved with running gamer and SciFi events for over a decade, as they are a way to bring joy to her communities. When she is not doing that, she works as a communications expert and is a human rights activist.\n\nTwitter: <a href=\"https:\/\/twitter.com\/sharrow_irl\" target=\"_blank\">@sharrow_irl<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp401551f39bd4e1923840262de4fae760.jpg"}},{"id":"A0072","name":["Angeline B. Adams"],"prog":["12","41","72"],"bio":"Angeline B. Adams grew up in County Down, gazing out at the landscape that inspired C.S. Lewis’s Narnia, and nurturing a lifelong skill at finding space for new books in seemingly crammed bookcases. She also encountered Conan the Barbarian and the Terminator at an impressionable age, and if she hasn’t yet managed to solve all her problems by wielding a sword or travelling through time, it’s not for want of trying. \n\nWeb: <a href=\"https:\/\/turniplanterns.wordpress.com\" target=\"_blank\">https:\/\/turniplanterns.wordpress.com<\/a> and <a href=\"https:\/\/linktr.ee\/turniplanterns\" target=\"_blank\">https:\/\/linktr.ee\/turniplanterns<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/angelinebadams\" target=\"_blank\">@angelinebadams<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/TurnipLanternsPress\" target=\"_blank\">TurnipLanternsPress<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp3e5242f80d87a2f702621ac1e9076b3d.jpg"}},{"id":"A0077","name":["Samuel Poots"],"prog":["7","8","17","72","86"],"bio":"Samuel Poots is a writer from N. Ireland who communicates through Pratchett quotes. His work appears in Daily SF, Toasted Cake, Jim Henson's Labyrinth: The Adventure Game, and Mag of Holding. If found, please give him a cup of tea and send him home by the Post Office.\n\n\nTwitter: <a href=\"https:\/\/twitter.com\/pootsidoodle\">@pootsidoodle<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp1657afabc60eaed3561b8ce73db18318.png"}},{"id":"A0079","name":["Faranae"],"prog":["12","14","15","28"],"bio":"{honk}","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp95a7a431ba8aa1ed5de48507c8fb6886.jpg"}},{"id":"A0089","name":["Cora Buhlert"],"prog":["18","21","81"],"bio":"Cora Buhlert was born and bred in Bremen, North Germany, where she still lives today – after time spent in London, Singapore, Rotterdam and Mississippi. Cora holds an MA degree in English from the University of Bremen. Cora has been a science fiction fan for as long as she can remember and blogs about SFF both at her own site and Galactic Journey. Cora has a special interest in the past of our genre and likes to review and discuss SFF dating from the 1920s to 1960s. Cora is a two-time Hugo finalist for Best Fan Writer and the winner of the 2021 Space Cowboy Award. Cora has been writing, since she was a teenager, and has published stories, articles and poetry in various international magazines. Though she writes in various genres, science fiction and fantasy will always be her first love. When Cora is not writing, she works as a translator and teacher. \n\nWeb: <a href=\"http:\/\/corabuhlert.com\" target=\"_blank\">corabuhlert.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/CoraBuhlert\" target=\"_blank\">@CoraBuhlert<\/a>\n\n ","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp5ae51d591892df1f1c984e75465428be.jpg"}},{"id":"A0109","name":["Dav Waldron"],"prog":["84","86","89","93"],"bio":"A lifelong nerd with a penchant for games.","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp3fdb0d7373661aac4fbd105da92603cf.png"}},{"id":"A0143","name":["Elaine McIonyn"],"prog":["18"],"bio":"&nbsp;","links":[]},{"id":"A0145","name":["Sakura Perez"],"prog":["1","2","14","15"],"bio":null,"links":[]},{"id":"A0146","name":["Kat Dodd"],"prog":["12","32","38","78","104","106","108"],"bio":"Kat Dodd is an American transplant that escaped from a small town in Arkansas right between Toad Suck, Pickles Gap, and Wooster. The first story they ever wrote was in a purple crayon in their journal, and Kat hasn't stopped writing since. Their typical genres are a conglomeration of fantasy\/sci-fi, LGBTQI+, and YA, with a thread of romance going through them. Kat lives with their Spouse-Type-Creature, though Kat frequently forgets to feed him.\n\nTwitter: <a href=\"https:\/\/www.twitter.com\/TheKatDodd\" target=\"_blank\">@TheKatDodd<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp1c99ddb6529a9aba20e4068449dd3b30.png"}},{"id":"A0159","name":["Kaaron Warren"],"prog":["90","96"],"bio":"Shirley Jackson award-winner Kaaron Warren published her first short story in 1993 and has had fiction in print every year since. She was recently given the Peter McNamara Lifetime Achievement Award and was Guest of Honour at World Fantasy 2018, Stokercon 2019 and Geysercon 2019.\nShe has published five multi-award winning novels (<em>Slights<\/em>, <em>Walking the Tree<\/em>, <em>Mistification<\/em>, <em>The Grief Hole<\/em> and <em>Tide of Stone<\/em>) and seven short story collections, including the multi-award winning <em>Through Splintered Walls<\/em>. Her most recent short story collection is <em>A Primer to Kaaron Warren<\/em> from Dark Moon Books. Her most recent novella, <em>Into Bones Like Oil<\/em> (Meerkat Press), was shortlisted for a Shirley Jackson Award and the Bram Stoker Award, winning the Aurealis Award. Her stories have appeared in both Ellen Datlow’s and Paula Guran’s Year’s Best anthologies.\nKaaron was a Fellow at the Museum for Australian Democracy, where she researched prime ministers, artists and serial killers. In 2018 she was Established Artist in Residence at Katharine Susannah Prichard House in Western Australia. She’s taught workshops in haunted asylums, old morgues and second hand clothing shops and she’s mentored several writers through a number of programs.\nHer most recent books include the re-release of her acclaimed novel, <em>Slights<\/em> (IFWG Australia), <em>Tool Tales<\/em>, a chapbook in collaboration with Ellen Datlow (also IFWG), and <em>Capturing Ghosts<\/em>, a writing advice chapbook from Brain Jar Press.\n\n\nTwitter: <a href=\"https:\/\/twitter.com\/KaaronWarren\" target=\"_blank\">@KaaronWarren<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/kaaron.warren\" target=\"_blank\">kaaron.warren<\/a>\nInstagram: <a href=\"https:\/\/instagram.com\/Kaaron_Warren\" target=\"_blank\">@Kaaron_Warren<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp3d0de343cb2e9a4928bd69fb882454cb.jpg"}},{"id":"A0179","name":["Róisín Loughran"],"prog":["5"],"bio":"Róisín thought she was one of the biggest Discworld fans ever, until attending her first convention and experiencing an 'A-Ha!' moment. After attending IDWCon in 2011, she had such fun that she volunteered to join the organising Committee. She undertook the role of Merchandise Officer in 2013, 2015 and 2017 and apparently did such a good job that they put her (partially) in charge for 2021. Róisín is still not sure who ‘they’ are – but she would like a strong word with them at some point.  \n\nTwitter: <a href=\"https:\/\/twitter.com\/IDWCon\" target=\"_blank\">@IDWCon<\/a>  Facebook: <a href=\"https:\/\/www.facebook.com\/groups\/idwcon2021\" target=\"_blank\">Irish Discworld Convention 2021<\/a> (private group)","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp434809417ff3a50f038781bf4b24de4b.png"}},{"id":"A0181","name":["Sarah Murray"],"prog":["72"],"bio":"Sarah is a writer working on her PhD in Creative Writing by Practice at Ulster University. She also has a BA and a Masters in Creative Writing and has been published in several anthologies, including <em>As You Wish<\/em> by Rogue Blades Entertainment\n\nTwitter: <a href=\"https:\/\/twitter.com\/Payperbacwriter\" target=\"_blank\">@Payperbacwriter<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp5223567aac0d77a88ed743392aaebd54.png"}},{"id":"A0192","name":["Gary McKay"],"prog":["72"],"bio":"Gary McKay is a speculative fiction writer from Northern Ireland. He’s had stories published in Kraxon Magazine, The Purple Breakfast Review and Tidbits, as well as in several anthologies. He's currently undertaking a PhD in Creative Writing at the University of Ulster, researching how contemporary Gothic novels engage with trauma and loss.\n\nTwitter: <a href=\"https:\/\/twitter.com\/garycmckay\" target=\"_blank\">@garycmckay<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppa438bd8be9ac93324879f4d9d8db63fc.png"}},{"id":"A0220","name":["Kalin Nenov"],"prog":["24"],"bio":"Kalin M. Nenov (Kal\/any) is a translator, editor, publisher, agent, and writer. Currently, he lives in Sofia, Bulgaria, and serves as Creative Director of the <a href=\"https:\/\/choveshkata.net\/blog\/?page_id=8419\" target=\"_blank\">Human Library Foundation<\/a>: a volunteer community preparing, publishing and promoting fiction that examines what it means to be human--and how to expand the definition. Kal's translations have appeared in various magazines and anthologies, most notably <em>Up and Coming: Stories by the 2016 Campbell-Eligible Authors<\/em> and most recently <em>Compelling Science Fiction #15<\/em> in 2020. Many of them have been collected in the forthcoming <em>ФантАstika: Almanac of Bulgarian Speculative Fiction<\/em>; you can <a href=\"https:\/\/choveshkata.net\/blog\/?page_id=8359\" target=\"_blank\">request the preview version<\/a>.\nFind more on Kal's <a href=\"https:\/\/www.goodreads.com\/author\/show\/5052829.Kalin_M_Nenov\" target=\"_blank\">Goodreads Author Profile<\/a>.\nKal has been devouring and championing optimistic speculative fiction since his early teen years in the 1990s. He looks up for inspiration to such writers as Michael Ende, Terry Pratchett, David Brin, Lois McMaster Bujold, David Zindell, Peter S. Beagle, Theodore Sturgeon, Nikolay Tellalov, Velichka Nastradinova, Ivan Yefremov, Patricia A. McKillip, and Rachel Aaron. His latest fascination is solarpunk.\nKal maintains a <a href=\"https:\/\/www.goodreads.com\/review\/list\/741149-kalin?shelf=uplifting\" target=\"_blank\">list of optimistic fiction<\/a> (mostly speculative) on Goodreads. Currently, it contains over 200 titles.\n","links":[]},{"id":"A0253","name":["Sarah J. Daley"],"prog":["115"],"bio":"Sarah J. Daley is a former chef who lives and writes in the Chicago Metropolitan area with her husband and teenaged son. She earned a degree in Landscape Architecture from the University of Illinois at Champaign-Urbana. Though she still enjoys the heat and chaos of a professional kitchen, she is now writing full-time. She enjoys traveling, creating costumes for comic con, riding the occasional horse, and streaming old sitcoms for background noise.\n\nTwitter: <a href=\"https:\/\/twitter.com\/SarahJDaley\" target=\"_blank\">@SarahJDaley<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp27f3229b12cb2cfe390a036839f158e9.png"}},{"id":"A0256","name":["Ginger Smith"],"prog":["114"],"bio":"Ginger Smith became interested in science-fiction\/fantasy when reading her father’s collection of 1960’s-1970’s paperbacks as a kid. Her writing career started at the age of ten, when she read a fantasy novel that disappointed her with its ending. Soon after, her love of writing stories led to being chosen to participate in the South Carolina Young Writer’s Conference. In her early teen years she wrote her own fantasy novel (that will never see the light of day). Tabletop RPG’s and collecting vintage sci-fi toys and novels are just a few of her hobbies. Ginger holds a Master’s degree in English from Troy University and has been an English teacher for 20 years. Currently, she lives in the southern USA with her husband and two cats. Her book <em>The Rush’s Edge<\/em> was purchased by Angry Robot for publication in 2020.\n\nWeb: <a href=\"https:\/\/ginger-smith-author.com\/\" target=\"_blank\">ginger-smith-author.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/GSmithauthor\" target=\"_blank\">@GSmithauthor<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppd376dc4849cd2e10c5858392ab49fefa.png"}},{"id":"A1101","name":["Brian Quigley"],"prog":["5"],"bio":"Brian Quigley is one of the founders of Celtic Throwdown, Ireland’s premiere esports event.\nHe was Ireland’s first live gaming event streamer, and one of the hosts of the “Is That Canon?” comic book podcast, and a regular Irish convention attendee since 1997.\nA big fan of Doctor Who, Discworld, and all things giant shape-changing robot.","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppf9814ec3ba4b4c0d27b0fd2cc21f1a6f.jpg"}},{"id":"M1001","name":["Dan Abnett"],"prog":["6","10","46","56","79","94"],"bio":"Dan Abnett is a multiple New York Times bestselling author and an award-winning comic book writer. He has written over fifty novels, including the acclaimed Gaunt's Ghosts series, the Inquisitor Eisenhorn Cycle, and volumes of the million-selling Horus Heresy series. His many other novels include <em>The Silent Stars Go By<\/em> (Doctor Who), <em>Rocket Raccoon and Groot: Steal the Galaxy<\/em>, <em>Triumff<\/em>, and <em>Embedded<\/em>. In comics, his 2008 run on The Guardians of the Galaxy for Marvel formed the inspiration for the blockbuster movies. He is also noted for significant work on DC's Legion of Superheroes and Aquaman and, for the Vertigo imprint, The New Deadwardians. A regular contributor to the UK's long-running 2000AD, he is the creator of series including Brink, Grey Area, Feral and Foe, Lawless, Kingdom and the classic Sinister Dexter. He has also written extensively for the games industry, including Shadow of Mordor and Alien: Isolation. Dan lives and works in Maidstone, Kent, in the UK.","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp88f629649480108e54bf05ec27328108.png"}},{"id":"M1002","name":["Nik Vincent-Abnett"],"prog":["6","10","26","65","75"],"bio":"Nik Vincent-Abnett began working as a freelance editor, but has published work in a number of mediums, including advertising, training manuals, comics and short stories. She has worked as a ghost writer, and has collaborated with her partner, Dan Abnett, writing novels, and in the games industry. Nik’s latest solo, independent novel, <em>The Wipe<\/em>, was published by NewCon Press in the spring. She lives and works in Maidstone, Kent, where she cooks and decorates, and throws pots.","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp26585376d9cc5e7235adc84dc4d95897.jpg"}},{"id":"M1003","name":["Michael Carroll"],"prog":["9","21","50","76","90","95"],"bio":"Michael Carroll is the author of over forty books, including the award-winning <em>New Heroes<\/em> series of Young Adult superhero novels and the #1 Amazon best-selling cult graphic novel <em>Judge Dredd: Every Empire Falls<\/em>. He currently writes Judge Dredd, Proteus Vex, Mayflies and Dreadnoughts for 2000AD and Judge Dredd Megazine. Other works include <em>Jennifer Blood<\/em> for Dynamite Entertainment, <em>Razorjack<\/em> for Titan Books (co-written with artist John Higgins), and the <em>Rico Dredd<\/em> trilogy for Abaddon Books, for whom he has also created the acclaimed <em>Judges<\/em> series. <\/p>\n\nCheck out his website at <a href=\"https:\/\/www.michaelowencarroll.com\" target=\"_blank\">www.michaelowencarroll.com<\/a> and\/or his acclaimed comics blog Rusty Staples at <a href=\"https:\/\/michaelowencarroll.wordpress.com\" target=\"_blank\">michaelowencarroll.wordpress.com<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp53a0370ec602023003cbc54c1ed0ae3a.jpg"}},{"id":"M1004","name":["Ann Gry"],"prog":["14","15","81","85","88","92"],"bio":"&nbsp;","links":[]},{"id":"M1005","name":["Joseph Elliott-Coleman"],"prog":["10","16","62"],"bio":"Joseph Elliott-Coleman hails from Croydon, Greater London and is a writer of science fiction and fantasy. He has work published by Rebellion books for their Judges novella series (<em>The Patriots<\/em>), Not So Stories (<em>Queen<\/em>), by Newcon Books in their anthology <em>London Centric: Tale of a future London (Death Aid)<\/em> and had been published in 2000AD. ","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp9a709eae47bb39d1b03f0dfe0cf684f8.jpg"}},{"id":"M1006","name":["Jack Fennell"],"prog":["9","18","59"],"bio":"Jack Fennell is a writer, anthologist and editor from Limerick. He has published academic studies on Irish science fiction and horror fiction, and he is the editor of the science fiction anthology <em>A Brilliant Void<\/em> (2018) and the fantasy anthology <em>It Rose Up<\/em> (2021). He also publishes short fiction, as himself and also under the name Jack Deel. He teaches at the University of Limerick.\n\nTwitter: <a href=\"http:\/\/twitter.com\/JFennellAuthor\" target=\"_blank\">@JFennellAuthor<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppf3ef78176cd36c4a8e6c4960cf653626.jpg"}},{"id":"M1007","name":["Kim Newman"],"prog":["11","74","92"],"bio":"Kim Newman is a movie critic, author and broadcaster.  He is a contributing editor to <em>Sight &amp; Sound <\/em>and <em>Empire<\/em> magazines.  His books about film include <em>Nightmare Movies, Millennium Movies<\/em>, <em>Kim Newman’s Video Dungeon<\/em> and BFI Classics studies of <em>Cat People<\/em>, <em>Doctor Who<\/em> and <em>Quatermass and the Pit<\/em>.  His fiction includes the <em>Anno Dracula <\/em>series, <em>Life’s Lottery<\/em>, <em>Professor Moriarty:<\/em> <em>The Hound of the D’Urbervilles<\/em>, <em>An English Ghost Story<\/em>, <em>The Secrets of Drearcliff Grange School <\/em>and<em> Angels of Music<\/em>.  His comics include <em>Witchfinder: The Mysteries of Unland<\/em> and <em>Anno Dracula Seven Days in Mayhem<\/em>.  As ‘Jack Yeovil’, he wrote the Vampire Genevieve and Dark Future novels for Games Workshop.  His next novel is <em>Something More Than Night <\/em>(Titan Books).  He has written for television (<em>Mark Kermode’s Secrets of Cinema<\/em>), radio (<em>Afternoon Theatre: Cry-Babies<\/em>) and the theatre (<em>The Hallowe’en Sessions<\/em>), and directed a tiny film (<em>Missing Girl<\/em>). \n\nWeb: <a href=\"http:\/\/www.johnnyalucard.com\/\" target=\"_blank\" rel=\"noopener\">www.johnnyalucard.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/AnnoDracula\" target=\"_blank\" rel=\"noopener\">@AnnoDracula<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp718b315f22dab55838d865496888d1c4.jpg"}},{"id":"M1008","name":["Maura McHugh"],"prog":["17","74"],"bio":"Maura McHugh lives in Galway and has written three collections: <em>Twisted Fairy Tales<\/em> and <em>Twisted Myths<\/em> - published in the USA - and <em>The Boughs Withered (When I Told Them My Dreams)<\/em> from NewCon Press in England (which was nominated for a British Fantasy Award for Best Collection). Her science fiction rom-com radio play, The Love of Small Appliances, broadcast in June 2019, is available online. She's written comic books for Dark Horse, IDW, and 2000 AD, and her monograph about David Lynch's iconic film, <em>Twin Peaks: Fire Walk With Me<\/em>, was nominated for a British Fantasy Award for Best Non Fiction. She walks and dreams in the woods often.\n\nTwitter: <a href=\"https:\/\/twitter.com\/splinister\" target=\"_blank\">@splinister<\/a>\nInstagram:  <a href=\"https:\/\/instagram.com\/splinister\" target=\"_blank\">@splinister<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp24a4dfda2a9f68393b9ca696f44940a5.jpg"}},{"id":"M1009","name":["Peadar Ó Guilín"],"prog":["10","19","25","51","66"],"bio":"Irish writer Peadar Ó Guilín is the author of the YA novel, <em>The Call<\/em>, inspired by the beautiful northwest of Ireland where he grew up. <em>The Invasion<\/em>, a sequel to <em>The Call<\/em> and the end of the duology, was published in March 2018 and was a finallist for the 2019 Lodestar Award for Best Young Adult Book, awarded at Dublin 2019, an Irish Worldcon.<br>In September 2007, Peadar published his first novel, <em>The Inferior<\/em>, which the Times Educational Supplement called 'a stark, dark tale, written with great energy and confidence and some arresting reflections on human nature.' Foreign editors liked it too, and over the coming year it is to be translated into eight languages, including Japanese and Korean.<br>His fantasy and SF short stories have appeared in numerous venues, including Black Gate magazine and an anthology celebrating the best of the iconic Weird Tales.\n\nTwitter: <a href=\"https:\/\/www.twitter.com\/TheCallYA\" target=\"_blank\">@TheCallYA<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp3837a19a1aa80890be4774a6162ebd28.png"}},{"id":"M1010","name":["Ruth Frances Long \/ Jessica Thorne"],"prog":["10","17","25","52","70","73"],"bio":"Ruth Frances Long writes young adult fantasy, often about scary fairies. She works in a specialized library of rare &amp; occasionally crazy books.\nIn 2015 she won the European Science Fiction Society Spirit of Dedication Award for Best Author of Children's Science Fiction and Fantasy for <em>A Crack in Everything<\/em>.\nAs Jessica Thorne she writes Fantasy, Space Opera and other fantastic tales, including <em>The Lost Girls of Foxfield Hall<\/em>, <em>The Queen’s Wing<\/em>, <em>Mageborn<\/em> and <em>Nightborn<\/em>. <em>The Stone's Heart<\/em> was nominated for the Romantic Novelists' Association Romantic Fantasy novel of the year in 2020. Her latest novel, <em>The Bookbinder's Daughter<\/em> will be available on the 20<sup>th<\/sup> September from Bookouture.\n\nWeb: <a href=\"http:\/\/www.rflong.com\/\" target=\"_blank\">www.rflong.com<\/a> | Twitter: <a href=\"https:\/\/twitter.com\/rflong\" target=\"_blank\">@RFLong<\/a> and <a href=\"https:\/\/twitter.com\/jessthornebooks?lang=en\" target=\"_blank\">@JessThorneBooks<\/a><br>Facebook: <a href=\"https:\/\/www.facebook.com\/RuthFrancesLong?ref=hl\" target=\"_blank\">R. F. Long<\/a> and <a href=\"https:\/\/www.facebook.com\/JessThorneBooks\" target=\"_blank\">Jessica Thorne Author<\/a><br>Instagram: <a href=\"https:\/\/instagram.com\/ruthfranceslong\/\" target=\"_blank\">@RuthFrancesLong<\/a> and <a href=\"https:\/\/www.instagram.com\/jessthornebooks\/\" target=\"_blank\">@JessThorneBooks<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppecc3b3b1a20bf967655f22fa94961682.png"}},{"id":"M1012","name":["Amie Kaufman"],"prog":["6","19"],"bio":"Amie Kaufman is a New York Times, USA Today and internationally bestselling author of science fiction and fantasy. Her multi-award winning work has been translated into nearly thirty languages, and has been described as “a game-changer” (Shelf Awareness), “stylistically mesmerising” (Publishers Weekly) and “out-of-this-world awesome” (Kirkus). Several of her series are currently in development for film and TV. Raised in Australia and occasionally Ireland, Amie has degrees in history, literature, law and conflict resolution, and is currently undertaking a PhD in Creative Writing. She is the host of the podcast Amie Kaufman on Writing. Amie lives by the sea in Melbourne, Australia with her husband, daughter, and rescue dog, and an extremely large personal library.\n\nTwitter: <a href=\"https:\/\/twitter.com\/amiekaufman\" target=\"_blank\">@amiekaufman<\/a>\nInstagram: <a href=\"https:\/\/instagram.com\/amiekaufmanauthor\" target=\"_blank\">@amiekaufmanauthor<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppa7880c341471b746c76f1b5a249c5a39.png"}},{"id":"M1013","name":["Shelly Bond"],"prog":["95"],"bio":"Shelly Bond is the editor of the Eisner award-winning series <em>Bitter Root<\/em>, <em>Fables<\/em>, and <em>The Sandman: Overture.<\/em> She's the Editor-in-Chief of OFFREGISTER.PRESS and BLACK CROWN with her husband, artist Philip Bond. A former DC\/Vertigo Executive and Editor for over two decades, Bond has been driven to edit &amp; curate comic books, crush deadlines and design\/innovate. She’s best known for her self-published anthologies funded through Kickstarter including <em>Hey, Amateur!<\/em>, <em>Insider Art<\/em>,<em> Femme Magnifique: 50 Magnificent Women Who Changed The World,<\/em> and <em>Heavy Rotation<\/em>. Shelly is currently writing and art directing her magnum opus, <em>Filth &amp; Grammar: The Comic Book Editor’s Secret Handbook,<\/em> thanks to 2,375 Kickstarter backers. She wields red pens and tap shoes with equal aplomb and lives in Los Angeles.\n\nWeb: <a href=\"https:\/\/www.offregister.press\/\" target=\"_blank\">www.offregister.press<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp765005417878abb090e206977b70feaf.jpg"}},{"id":"M1014","name":["Jo Zebedee"],"prog":["25","48","61","78"],"bio":"Jo is a sci fi and fantasy author from the frozen North, near Belfast. She also runs a bookstore, and a consultancy, and welcomes all offers of cloning.\n\nTwitter: <a href=\"https:\/\/twitter.com\/jozebwrites\" target=\"_blank\">@jozebwrites<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp3726998420939aad3ce20fe656db66de.jpg"}},{"id":"M1015","name":["Francesco Verso"],"prog":["23","24"],"bio":"Francesco Verso is a multiple-award Science Fiction writer and editor. <br>He has published: <em>Antidoti umani<\/em>, <em>e-Doll<\/em>, <em>Nexhuman<\/em>, <em>Bloodbusters<\/em> and <em>I camminatori<\/em> (made of <em>The Pulldogs<\/em> and <em>No\/Mad\/Land<\/em>).  <em>Nexhuman <\/em>and <em>Bloodbusters<\/em> – translated in English by Sally McCorry – have been published in the US by Apex Books, in the UK by Luna press and in China by Bofeng. He also works as editor of <em>Future Fiction<\/em>, a multicultural project, dedicated to scouting and publishing the best SF in translation from the World, from more than 30 countries and 11 languages with authors like Ian McDonald, Ken Liu, Liu Cixin, Vandana Singh, Xia Jia, Carme Torras, Olivier Paquet and others.  From 2019 he's the Honorary Director of the Fishing Fortress SF Academy of Chongqing (China). In 2020 he co-organized the FutureCon, an online convention with more than 65 guests coming from 20 different countries. \n\nTwitter: <a href=\"https:\/\/twitter.com\/Francesco_Verso\" target=\"_blank\">@Francesco_Verso<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp10b7dfedbc7399434e33763500b1c290.png"}},{"id":"M1016","name":["Darren Shan"],"prog":["4"],"bio":"Darren Shan was born in London but has spent most of his life in Limerick in Ireland, where he lives with his wife and children. He has published 57 books for both children and adults, and has sold over 30 million books worldwide, making bestseller charts in the USA, the UK, Ireland, Hungary, Dubai, Japan, Taiwan and elsewhere. He is currently writing the <em>Archibald Lox<\/em>&nbsp;fantasy series, of which six books have already been published, with the final three due to see print in 2022.\n\nWebsite: <a href=\"https:\/\/darrenshan.com\/\" target=\"_blank\">darrenshan.com\/<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/darrenshan\" target=\"_blank\">@darrenshan<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/darrenshanverified\/\" target=\"_blank\">darrenshanverified<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp42278a729ccdf345d6621db79c67a67f.png"}},{"id":"M1017","name":["Gillian Polack"],"prog":["13","40","47","58","73"],"bio":"Dr Gillian Polack is a Jewish-Australian science fiction and fantasy writer, researcher and editor and is the winner of the 2020 A Bertram Chandler Award. <em>The Green Children Help Out<\/em> (a Jewish superhero novel) was released in late July. Her 2019 novel <em>The Year of the Fruit Cake<\/em> won the 2020 Ditmar for best novel and was shortlisted for best SF novel in the Aurealis Awards. She wrote the first Australian Jewish fantasy novel (<em>The Wizardry of Jewish Women<\/em>). Gillian is a Medievalist\/ethnohistorian, currently working on how novels transmit culture. Her work on how writers use history in their fiction (<em>History and Fiction<\/em>) was shortlisted for the William Atheling Jr Award for Criticism or Review.\n\nTwitter: <a href=\"https:\/\/twitter.com\/GillianPolack\" target=\"_blank\">@GillianPolack<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/gillian.polack\/\" target=\"_blank\">gillian.polack<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppcbd4feadbd2a31a2d67e3535c0a0c531.png"}},{"id":"M1019","name":["Gareth Hanrahan"],"prog":["57","74","75","84"],"bio":"Gareth Hanrahan’s a writer and game designer based in Cork. He’s written more gaming books than he can readily recall, by virtue of the alchemical transformation of tea and guilt into words.\n\nWeb: <a href=\"http:\/\/garhanrahan.com\/\" target=\"_blank\">garhanrahan.com<\/a>\nTwitter: <a href=\"https:\/\/www.twitter.com\/mytholder\" target=\"_blank\">@mytholder<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppeef304ea0260840b8391e2590ff64755.jpg"}},{"id":"M1020","name":["Fabio Fernandes"],"prog":["20","23","24","53","71"],"bio":"Fabio Fernandes is a Brazilian writer currently based in Italy. He has published several books, among which the novels <em>Os Dias da Peste<\/em> and <em>Back in the USSR<\/em> (in Portuguese) and the collection <em>L'Imitatore<\/em> (in Italian). Also a translator, he is responsible for the translation to<br>Brazilian Portuguese of several SF novels, including <em>Neuromancer<\/em> and <em>A Clockwork Orange<\/em>. His short stories have been published online in Brazil, Portugal, Romania, the UK, New Zealand, and USA, and also in Ann and Jeff VanderMeer’s <em>Steampunk II: Steampunk Reloaded<\/em>, <em>The Apex Book of World SF, Vol 2, Stories for Chip<\/em>. Co-edited (with Djibril al-Ayad) the postcon anthology <em>We See a Different Frontier<\/em>, and, with Francesco Verso, the anthology <em>Solarpunk - Come ho imparato ad amare il futuro<\/em> (<em>How I learned to love the future)<\/em>. Graduate of Clarion West, class of 2013. Formerly slush reader for Hugo Award-winner Clarkesworld Magazine. His first book in English, the collection <em>Love. An Archaeology<\/em>, was published in March by Luna Press Publishing. A steampunk novella, <em>Under Pressure<\/em>, will be published by NewCon Press later this year, and a weird SF novel, <em>Love Will Tear Us Apart<\/em> (in Portuguese) will be published by Uboro Lopes Editora in 2022.\n\nTwitter: <a href=\"https:\/\/twitter.com\/fabiofernandes\" target=\"_blank\">@fabiofernandes<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp12e86824241324f8a18df473e6d822db.jpg"}},{"id":"M1021","name":["Aliette de Bodard"],"prog":["9","25","45","54","75"],"bio":"Aliette de Bodard lives and works in Paris. She has won three Nebula Awards, a Locus Award, a British Fantasy Award and four British Science Fiction Association Awards. She was a double Hugo finalist for 2019 (Best Series and Best Novella).<br>Her most recent book is <em>Fireheart Tiger<\/em> (Tor.com), a sapphic romantic fantasy inspired by pre colonial Vietnam, where a diplomat princess must decide the fate of her country, and her own. She also wrote <em>Seven of Infinities<\/em> (Subterranean Press), a space opera where a sentient spaceship and an upright scholar join forces to investigate a murder, and find themselves falling for each other. Other books include <em>Of Dragons, Feasts and Murders<\/em>, (JABberwocky Literary Agency, Inc.), a fantasy of manners and murders set in an alternate 19th Century Vietnamese court.<br>Her space opera books include <em>The Tea Master and the Detective <\/em>(2018 Nebula Award winner, 2018 British Fantasy Award winner, 2019 Hugo Award finalist). Her short story collection <em>Of Wars, and Memories, and Starlight<\/em> is out from Subterranean Press.\n\nWeb: <a href=\"https:\/\/www.aliettedebodard.com\/\" target=\"_blank\">www.aliettedebodard.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/aliettedb\" target=\"_blank\">@aliettedb<\/a>\nInstagram: <a href=\"https:\/\/www.instagram.com\/aliettedb\" target=\"_blank\">@aliettedb<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppb0c25aefae37d43d3cfdd78c7c53e396.jpg"}},{"id":"M1022","name":["Robert JE Simpson"],"prog":["11","13","92"],"bio":"Robert JE Simpson is a freelance writer, broadcaster, publisher, artist and cultural historian from Belfast.<br>Formerly the official archivist for Hammer Films, he was founding editor of Diabolique magazine. He has contributed to books, magazines, blu-rays, and documentaries. He is a regular contributor to BBC Radio Ulster on cultural matters, and is co-director (with R.B. Kelly) and host of CinePunked - a Belfast-based collective that specialises in live events and podcasts relating to film. He has recently been working on programming around issues of mental health, spent most of the pandemic drawing and has just published his first book <em>The Willing Fool - The Spectacle of The Wicker Man<\/em>.\nHe is writing a book on Hammer's sister company Exclusive Films, and a monograph inspired by Hitchcock's Vertigo. \n\nWeb: <a href=\"http:\/\/linktr.ee\/avalard\" target=\"_blank\">http:\/\/linktr.ee\/avalard<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/avalard\" target=\"_blank\">@avalard<\/a>\nFacebook: <a href=\"http:\/\/www.facebook.com\/robertjesimpson\" target=\"_blank\">robertjesimpson<\/a>\nInstagram: <a href=\"https:\/\/instagram.com\/robertjesimpson\" target=\"_blank\">@robertjesimpson<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp85ee9fc09708a16fdf4df4bfca66c992.jpg"}},{"id":"M1023","name":["Graham Andrews"],"prog":["7"],"bio":"&nbsp;","links":[]},{"id":"M1024","name":["Kathy Ayers"],"prog":["20"],"bio":"&nbsp;","links":[]},{"id":"M1025","name":["Edmond Barrett"],"prog":["79","91"],"bio":"Edmond Barrett, is originally from the North-West of England and has lived in Dublin for the past twenty years. He is the author of the military science fiction series <i>The Nameless War<\/i> and <i>The Contact War<\/i>. He is also the creator of the urban fantasy novella <i>The Job Offer<\/i> and the time travel novel <i>Out of Era<\/i>. A civil servant by profession as well as an amateur student of history, Edmond is a keen wargamer, an avid reader and a devotee of low-tech science fiction who has happily found ways to combined most of these together. Edmond has recently become a father for the first time so if he appears to be dazed and confused, that’s probably the sleep deprivation. \n\nWeb: <a href=\"https:\/\/edmondbarrett.wordpress.com\/\" target=\"_blank\">edmondbarrett.wordpress.com<\/a>","links":[]},{"id":"M1026","name":["Sarah Bevan"],"prog":["76","77"],"bio":"Sarah Bevan is an illustrator based in Dublin. She believes in education through engaging visuals and humour. Her work seeks to teach people to value and respect the natural world and the ways that we as humans can do better, for nature and for each other. When she is not working on commissions for wonderful organisations at home and abroad, she is running tables at conventions like DCAF and WizardCon. Find her on Facebook or Instagram under Sarah's Simulacrum or online on <a href=\"https:\/\/www.sarahssimulacrum.com\" target=\"_blank\">www.sarahssimulacrum.com<\/a>.\n\nFacebook: <a href=\"https:\/\/www.facebook.com\/sarahssimulacrum\" target=\"_blank\">sarahssimalcrum<\/a>\nInstagram: <a href=\"https:\/\/www.instagram.com\/sarahssimulacrum\/\" target=\"_blank\">@sarahssimulacrum<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppa76352e9dbe927b7b6a63913715b036a.jpg"}},{"id":"M1027","name":["Conor Bredin"],"prog":["20","97"],"bio":"An author, a podcaster and a teacher. Conor has been a primary school teacher for the last ten years. In 2019 he self published his first book, The Longest Night. In 2020 he started up his podcast Story of a Storyteller, the podcast where he talks with other authors and gets to know their life story. He's currently working on his children's fantasy novel. \n\nWebsite: <a href=\"https:\/\/www.conorbredin.com\" target=\"_blank\">www.conorbredin.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/Conor_The_Geek\" target=\"_blank\">@Conor_The_Geek<\/a> and <a href=\"https:\/\/twitter.com\/StorytellPod\" target=\"_blank\">@StorytellPod<\/a>\nInstagram: <a href=\"https:\/\/www.instagram.com\/conorthegeek\/\" target=\"_blank\">@conorthegeek<\/a> and <a href=\"https:\/\/www.instagram.com\/storytellpod\/\" target=\"_blank\">@storytellpod<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp698411e8971f85eff46a99e866cc0543.png"}},{"id":"M1028","name":["Anne-Louise Fortune"],"prog":["92"],"bio":"&nbsp;","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppe5c134430621c8a1219ce1cf19813d61.jpg"}},{"id":"M1029","name":["Anthea West"],"prog":["11","74"],"bio":"Anthea West is a comic artist and illustrator living in Dublin. She's been making comics since 2009 like her self-published graphic novel <i>The Earthbound God<\/i>, <i>Sleep Tight<\/i>, <i>Tale<\/i> and her ongoing webcomic, <i>Fate<\/i>. Anthea loves cats, dogs and finds writing in the third person odd.\n\n\nTwitter: <a href=\"https:\/\/twitter.com\/antheawest\" target=\"_blank\">@antheawest<\/a>\nInstagram: <a href=\"https:\/\/instagram.com\/anthea_west\" target=\"_blank\">@anthea_west<\/a>\n\n ","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppc47eb2890f9ef37a708e5a0fb3eb8277.jpg"}},{"id":"M1030","name":["Carol Connolly"],"prog":["44"],"bio":"Carol is the ESFS Awards Administrator and was the Deputy Division Head for Programme at the Dublin 2019 Worldcon. She likes growing things and eating them.\n\nTwitter: <a href=\"https:\/\/twitter.com\/irishhatgirl\" target=\"_blank\">@irishhatgirl<\/a>","links":[]},{"id":"M1031","name":["Caroline Mullan"],"prog":["7"],"bio":"Caroline Mullan grew up in Belfast before moving to London to work in IT. Her long involvement with SF fandom spans many articles, reviews and panels, multiple roles organising conventions, and a long stint as a Trustee of the SF Foundation.  Her talk about James White's life and work was well received at Dublin 2019: An Irish Worldcon. She is currently chair of Conversation, a bid to organise the UK Eastercon in 2023.","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppd753b37fef2901c2c1ee17f4131aa639.jpg"}},{"id":"M1032","name":["Cheryl Morgan"],"prog":["12","21"],"bio":"Cheryl Morgan is a writer, editor and owner of <a href=\"https:\/\/wizardstowerpress.com\/\" target=\"_blank\">Wizard's Tower Press<\/a>. She has won four Hugo Awards. You can find her reviews in <a href=\"https:\/\/www.salonfutura.net\/\" target=\"_blank\">Salon Futura<\/a>. She has been a Guest of Honour at conventions and conferences in Finland, Croatia and Austria.\n\nTwitter: <a href=\"https:\/\/twitter.com\/CherylMorgan\" target=\"_blank\">@CherylMorgan<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp5616b514a13559e002939502ea785f60.jpg"}},{"id":"M1034","name":["Christopher Hwang"],"prog":["14","81"],"bio":"Christopher is a fan and conrunner based in Singapore, where he is one of the moderators for the Singapore Comics Community Facebook group and spends far too much of his time and money on his hobby of collecting comic book art. With the SCC group, he has organized events for local comics fans and helped to curate events in conjunction with the Singapore Toys Games and Comics Convention, with a focus on promoting South East Asian Creators.\nHe has volunteered or been on staff for several Worldcons, including the recent Dublin2019, where he was Area Head for the Comics\/Graphic Novels Programme. As a result of liasing with the Artist Guest of Honor, Sana Takeda, Chris was invited to appear on the NHK show 逆転人生 [Gyakuten Jinsei] to speak about her career and influence.\nA frequent traveller, Chris tries to overlap his vacations with local conventions, and thus has experience with SFF\/Comic conventions in Australia, China, Hong Kong, Japan, Malaysia, the Philippines, Singapore, the United Kingdom, the United States, and of course, Ireland. None of those visits were in the last couple of years, for obvious reasons ;)\n\n\nTwitter: <a href=\"https:\/\/twitter.com\/monkeygod\" target=\"_blank\">@monkeygod<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp3c062f8564e79e08e1f25952f7bf49b3.jpg"}},{"id":"M1035","name":["Christopher J Garcia"],"prog":["9"],"bio":"Christopher J Garcia is a writer\/fanzine editor\/curator\/historian\/film festival programmer\/painter\/pro wrestling enthusiast from Boulder Creek, California, USA. He's won a couple of Hugos, has two kids, edits Journey Planet, The Drink Tank, and Claims Department, as well as does a number of other things all over the place. Find him at <a href=\"http:\/\/journeyplanet.weebly.com\" target=\"_blank\">http:\/\/journeyplanet.weebly.com<\/a> or on pretty much every social media as johnnyeponymous.\n\nWeb: <a href=\"http:\/\/journeyplanet.weebly.com\" target=\"_blank\">journeyplanet.weebly.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/johnnyeponymous\" target=\"_blank\">@johnnyeponymous<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp1bd40c1e28375d57a1190fffcbae3c89.png"}},{"id":"M1036","name":["Clare Foley"],"prog":["17"],"bio":"Clare Foley is a Dublin-based illustrator and comic creator, using traditional watercolour techniques and hand lettering. She released her first comic, <em>La Grande Breteche<\/em> in 2016, followed by <em>Frozen Waste<\/em> (written by Aaron Fever) in 2017, and the <em>Blood Runs Cold<\/em> anthology in 2018 (featuring stories written by Paul Carroll, Gary Moloney, JP Jordan, PJ Holden, and lettered by Paul Carroll, Kevin Keane and Hassan Otsmane-Elhaou).<br>She has worked on a number of collaborative projects including with Linen Hall Library &amp; PRONI, and Alliance Francaise. She is a member of Rogue Comics Ireland, and a founding member of IrishComics.ie.\n\nWeb: <a href=\"https:\/\/clarefoleyart.com\" target=\"_blank\">clarefoleyart.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/clarefoleyart\" target=\"_blank\">@clarefoleyart<\/a>\nInstagram: <a href=\"https:\/\/instagram.com\/clare.foley93\" target=\"_blank\">clare.foley93<\/a>\nEtsy: <a href=\"https:\/\/etsy.com\/ie\/shop\/ClareFoleyArtist\" target=\"_blank\">ClareFoleyArtist<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp61e9b38a5359f163ae36da7ee5ae8e95.png"}},{"id":"M1037","name":["Damien Larkin"],"prog":["55","78","93"],"bio":"Damien is an Irish science fiction author and co-founder of the British and Irish Writing Community. His debut SF novel <i>Big Red<\/i> was longlisted for the BSFA award for Best Novel in 2019. The next novel in the series <i>Blood Red Sand<\/i> came out 6th July 2021.\n\nWeb: <a href=\"https:\/\/www.damienlarkinbooks.com\/\" target=\"_blank\">damienlarkinbooks.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/Damo_Dangerman\" target=\"_blank\">@Damo_Dangerman<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/DamienLarkinAuthor\/\" target=\"_blank\">DamienLarkinAuthor<\/a>\nInstagram: <a href=\"https:\/\/www.instagram.com\/damo_danger_larkin\/\" target=\"_blank\">@damo_danger_larkin<\/a>\n<a href=\"https:\/\/www.goodreads.com\/book\/show\/55945491-blood-red-sand\" target=\"_blank\">Goodreads<\/a>\n\n ","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp5d51a9b069c1098a3850a33e64ad09fd.png"}},{"id":"M1038","name":["David Ferguson"],"prog":["13","31"],"bio":"EIC of Irish Comic News and occasional comic book writer. ","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppcafa82d71921478c7c376d24f047d0a9.jpg"}},{"id":"M1039","name":["Declan Meenagh"],"prog":["26","32","36","89","103"],"bio":"Political, disabled, interested in hardware hacking, fan of a lot of things.","links":[]},{"id":"M1041","name":["Dr Helen Conrad-O'Briain"],"prog":["18"],"bio":"&nbsp;&nbsp;&nbsp;","links":[]},{"id":"M1042","name":["Harun Šiljak"],"prog":["22","26"],"bio":"Harun Šiljak reads and writes science fiction about implausible technological and very plausible social revolutions. As a lecturer in electronic engineering, he researches complex systems science and non-conventional means of communication and computation. He is fascinated by the concept of reversibility--ability of various systems to conserve information and safely return to a previous state, travel back in time even! His 2016 short story collection <i>Murder on the Einstein Express<\/i> was somewhat of an academic exercise--hopefully, his current work-in-progress will make much more artistic sense. He regularly publishes non-fiction pieces on science and technology, focusing on social challenges, complexity, repair and sustainability.\n\nTwitter: <a href=\"https:\/\/twitter.com\/E73HS\" target=\"_blank\">@E73HS<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pped456b8fdf96aaf7f8b09f6711ad0127.jpg"}},{"id":"M1043","name":["Ian Moore"],"prog":["17","21","26"],"bio":"Ian Moore has been reading and watching science fiction since he was very small. He worked with the administration teams for the Hugo Awards in 2019 and 2020, researching works from 1943 and 1944 for the Retro Hugos. He still has not written any science fiction of his own.\n\nWeb: <a href=\"https:\/\/secretpandablog.wordpress.com\" target=\"_blank\">secretpandablog.wordpress.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/IanMoore3000\" target=\"_blank\">@IanMoore3000<\/a>","links":[]},{"id":"M1044","name":["Karina Steffens"],"prog":["79","91"],"bio":"Karina Steffens began her love affair with fairy tales as a young girl in Soviet Ukraine, quoting Pushkin at anyone who'd listen. It followed her to Jerusalem, where she picked up a degree in Journalism, and to Dublin, where she consults as a web designer and writes SFF. Her work has appeared in Enchanted Conversation, Empyreome, and Gathering Storm, and is forthcoming in <em>Runs Like Clockwork<\/em> anthology by Wyldblood Press.\n\nTwitter: <a href=\"https:\/\/twitter.com\/KarinaSteffens\" target=\"_blank\">KarinaSteffens<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppcaf6ee8c920cde880d3467125bef162e.jpg"}},{"id":"M1045","name":["Pete Mullineaux"],"prog":["67","88"],"bio":"I live in Galway, Ireland. I teach global issues in schools through poetry and drama. I've published four poetry collections and had several plays produced by RTE radio including the sci-fi <em>Butterfly Wings<\/em> starring Owen Roe. My work has been discussed on RTE's popular arts\/culture programme ARENA. In 2021 I published <em>Interdependence Day: Teaching the Sustainable Development Goals through Drama<\/em> (Afri) which has a sci-fi theme, and my debut novel <em>Jules & Rom: Sci-fi meets Shakespeare<\/em> (Troubador Books UK). 'Certainly worth a gander' Irish Times.\n\nTwitter: <a href=\"https:\/\/twitter.com\/petemullineaux\" target=\"_blank\">@petemullineaux<\/a>\nFacebook: <a href=\"https:\/\/facebook.com\/petemullineaux\" target=\"_blank\">petemullineaux<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp6fa3fd5c1a7734568f57b03b5dc8bb31.png"}},{"id":"M1047","name":["Remco van Straten"],"prog":["72","78","91"],"bio":"Remco van Straten grew up on the heavy clay of the northern Dutch coast, where he fairly indiscriminately worked his way through any SFF book he could lay his hands on. Having absorbed many of the genre's must-reads, he also discovered Robert E. Howard's Conan at an impressionable age. During his student days he drifted westwards, ending up in Amsterdam, though Northernness has never left his writing or art. He co-created Waen Sinne, a pulp-inspired anthology with a lasting impact on Dutch SFF publishing, and was a jury member for the Paul Harland Award, the country's leading contest for speculative fiction.\nIn 2005 he moved to Northern Ireland, where he lives and writes with Angeline B. Adams. Initially covering arts and culture for publications like Verbal Magazine, Fortean Times and Culture Northern Ireland, they eventually decided to focus on speculative fiction. Their Fantasy collection, <em>The Red Man and Others<\/em>, is now in print, and their horror stories can be found in anthologies like <em>Underneath the Tree<\/em> (Sesheta), <em>The Wild Hunt: Stories of the Chase<\/em> (Air and Nothingness Press) and <em>Beyond the Veil<\/em> (Flame Tree Press), which will appear in October.\n\nWeb: <a href=\"https:\/\/turniplanterns.wordpress.com\" target=\"_blank\">https:\/\/turniplanterns.wordpress.com<\/a> and <a href=\"https:\/\/linktr.ee\/turniplanterns\" target=\"_blank\">https:\/\/linktr.ee\/turniplanterns<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/remcostraten\" target=\"_blank\">@remcostraten<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/TurnipLanternsPress\" target=\"_blank\">TurnipLanternsPress<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp414d155b598e8f7c296e7145c3c55ea0.jpg"}},{"id":"M1048","name":["Sakuya"],"prog":["14","76","81"],"bio":"&nbsp;","links":[]},{"id":"M1049","name":["Sean the Dino Guy"],"prog":["43"],"bio":"Having been fascinated by prehistory since a time before he could read, speak or stand in an upright position (he still struggles to do at least one of these things on a daily basis), Sean is considered one of the biggest dinosaur enthusiasts Ireland has ever produced.<br>As a former stand up comedian, Sean likes to show us the funny side of science, making his dinosaur talks as fun as they are educational (Sean has consulted with some of the world’s leading palaeontologists to sure that his content is as accurate as possible).<br>Kids will enjoy learning about dinosaurs from someone with this much enthusiasm, while the adults in the audience will find the humour and pop culture references worthy of a few chuckles.<br>Sean’s brand new Octocon show will see him tell us all about what dinosaurs we can expect to see in the upcoming Jurassic World: Dominion movie (expect to meet some new and familiar faces).<br>He has spoken to some of the film’s crew, so guarantees that he has the inside track!<br>The Dino Guy has delivered dinosaur talks at many venues (and 4 countries) and events including the Irish Film Institute, the UCD Science Expression Festival, Tayto Park, Dublin Comic Con and even London's Comedy Store.\n\nTwitter: <a href=\"https:\/\/twitter.com\/DinoGuyIRL\" target=\"_blank\">@DinoGuyIRL<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/DinoGuyIRL\/\" target=\"_blank\">DinoGuyIRL<\/a>\nInstagram: <a href=\"https:\/\/www.instagram.com\/dinoguyirl\/\" target=\"_blank\">@dinoguyirl<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp4b922aa9d002622fc58514fa85fccbc8.png"}},{"id":"M1050","name":["S.L. Dove Cooper"],"prog":["12","15","24","42"],"bio":"S.L. Dove Cooper \/ Dove Cooper (she\/they) is a bi demi queer indie SFF author and independent researcher who is terrible at bios. Their fiction focuses on soft, intimate and character-driven SFF, often with asexual and\/or aromantic characters at its heart. Exceptions exist. They write both novels (under S.L. Dove Cooper) and verse novels and poetry (under Dove Cooper).\n\nWeb: <a href=\"https:\/\/dovelynnwriter.com\/\" target=\"_blank\">dovelynnwriter.com<\/a>\nTwitter: <a href=\"https:\/\/twitter.com\/dovelynnwriter\" target=\"_blank\">@dovelynnwriter<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp85f82e4a30fbc7d5e889834f4dbad4a0.jpg"}},{"id":"M1051","name":["Tríona Farrell"],"prog":["80","94"],"bio":"Tríona is an Irish comic book colourist who has worked on titles such as <em>Crowed<\/em>, <em>Black Widow<\/em>, <em>Spider-Man<\/em> and <em>Terminator<\/em> and currently lives in Dublin with her partner and her cats.\n\nTwitter: <a href=\"https:\/\/twitter.com\/treestumped\" target=\"_blank\">@treestumped<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp79da854abae32cf0d7ed132169ab0a83.png"}},{"id":"M1053","name":["Vanessa MacLaren-Wray"],"prog":["15","22","23","89"],"bio":"Vanessa MacLaren-Wray is an award-winning author and poet who also builds robots, creates photographs, and works towards a more climate-safe world. She grew up in a military family, which meant constant moves: adapting to new worlds, new ways of speaking, and new cultures. Her first book, <i>All That Was Asked<\/i>, is a first-contact science fiction tale. No, of course it isn’t based on her childhood. Or is it?\nIn her free time, she devours cross-cultural dramas and sci-fi, plays location-based games, and stares into space. She is a first-generation Whovian, spent her formative years reading pony books and mysteries in Yorkshire, and now imagines she might be a Californian.\nYou can find out more at her website, <a href=\"https:\/\/cometarytales.com\" target=\"_blank\">cometarytales.com<\/a>.\n\n\nTwitter: <a href=\"https:\/\/twitter.com\/CometaryTales\" target=\"_blank\">@CometaryTales<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/CometaryTales\" target=\"_blank\">CometaryTales<\/a>\nInstagram: <a href=\"https:\/\/www.instagram.com\/cometarytales\/\" target=\"_blank\">@cometarytales<\/a>\nFlickr: <a href=\"https:\/\/www.flickr.com\/photos\/cometarytales\/albums\" target=\"_blank\">cometarytales<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp085dc1e94bc7b41090abc4d955fe6176.jpg"}},{"id":"M1054","name":["Aaron Fever"],"prog":["5","94"],"bio":"Aaron Fever is the writer of the ongoing webcomics <i>Ship Wrecked<\/i> and <i>Mr & Mrs Van Helsing<\/i>, the current writer of the all-ages series <i>Artos<\/i> from Buttonpress Publications, and has written the one-shot comics <i>Frozen Waste<\/i> and <i>Swift<\/i>.\n\nTwitter: <a href=\"https:\/\/twitter.com\/aaronfever\" target=\"_blank\">@aaronfever<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp2711ce61d23eedd2d6491c10702c5f4f.jpg"}},{"id":"M1055","name":["Declan Doody"],"prog":["84"],"bio":"Twitter: <a href=\"https:\/\/twitter.com\/DeclanDdy\" target=\"_blank\">@DeclanDdy<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp8827fd8634653d49ae35311fecf46128.png"}},{"id":"M1056","name":["Leeann Hamilton"],"prog":["77","79","80"],"bio":"A freelance artist and illustrator of your ideas.\n\nTwitter: <a href=\"https:\/\/twitter.com\/peannlui\" target=\"_blank\">@peannlui<\/a>\nInstagram: <a href=\"https:\/\/instagram.com\/peannlui\" target=\"_blank\">peannlui<\/a>\nYouTube: <a href=\"https:\/\/youtube.com\/peannlui\" target=\"_blank\">peannlui<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppea1816d4438e1e3180484797e9b4fc7f.png"}},{"id":"M1057","name":["Linda Butler"],"prog":["93"],"bio":"Linda is a cosplayer, crafter and content creator. Trekkie since TNG. Half of The Nerd Escape Podcast on YouTube. She\/her\n\nTwitter: <a href=\"https:\/\/twitter.com\/heninahat1\" target=\"_blank\">@heninahat1<\/a>\nInstagram: <a href=\"https:\/\/instagram.com\/Heninahat\" target=\"_blank\">@Heninahat<\/a> \n<a href=\"https:\/\/youtube.com\/channel\/UCNBrxxW3wVbKHy5ATpZz0mw\" target=\"_blank\">YouTube<\/a>\nEtsy: <a href=\"https:\/\/www.etsy.com\/uk\/shop\/HenInAHat\" target=\"_blank\">Hen In A Hat<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp70a4e6d5167b7ef04890ae2192fd804e.png"}},{"id":"M1058","name":["Marc McCluskey"],"prog":["86","99"],"bio":"Marc is Senior Library Assistant in Blanchardstown Library. He has been working in Public Libraries for nearly 15 years and has represented libraries at Worldcon and Octocon. He is a co-organiser for Dungeons and Dragons Dublin. His Sensory Friendly introductory DnD sessions have been running online through lockdown. He has just submitted his dissertation on tabletop gaming in public libraries to Dublin Business School.\n\nTwitter: <a href=\"https:\/\/twitter.com\/fingallibraries\" target=\"_blank\">@fingallibraries<\/a>\nFacebook: <a href=\"https:\/\/facebook.com\/fingallibraries\" target=\"_blank\">fingallibraries<\/a>\nInstagram: <a href=\"https:\/\/instagram.com\/librariesfingal\" target=\"_blank\">@librariesfingal<\/a>","links":[]},{"id":"M1059","name":["Fona"],"prog":["29","93"],"bio":"&nbsp;","links":[]},{"id":"M1061","name":["Julian West"],"prog":["88"],"bio":"Julian West has attended Octocon since some of the earliest. Winner of the <a href=\"https:\/\/www.jameswhiteaward.com\/award-history\" target=\"_blank\">James White<\/a>, Aeon and Frank Darcy awards. Currently working on a graphic novel. Also several novels and short stories.\n\n ","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp18f23b881bf604a910604dcd5de02bfe.png"}},{"id":"M1062","name":["Daniella Bella"],"prog":["80","84"],"bio":"Long-time Octocon organiser, disabled and LGBTQIA+ advocate, artist, writer, and Jill-of-all-trades.\n\n<a href=\"https:\/\/twitter.com\/BurlyQEinstein\" target=\"_blank\">@BurlyQEinstein<\/a>","links":[]},{"id":"M1063","name":["Esther MacCallum-Stewart"],"prog":["84","85"],"bio":"Esther is an Associate Professor of Games Studies at Staffordshire University, and Bid Chair for the Glasgow in 2024 Worldcon.","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppfe4c0f53c66e6023bb6044d9d71fc52c.jpg"}},{"id":"M1064","name":["Tobi\tOgundiran"],"prog":["16"],"bio":"Tobi Ogundiran is a British Science Fiction, Shirley Jackson, and Nommo award-nominated writer, whose dark and fantastical tales have appeared in The Dark, Beneath Ceaseless Skies, FIYAH, Tor.com among others.\n\nTwitter: <a href=\"https:\/\/twitter.com\/tobi_thedreamer\" target=\"_blank\">@tobi_thedreamer<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp44156d164ceac2d629f1ef1c478b6441.jpg"}},{"id":"M1065","name":["Sara Felix"],"prog":["101"],"bio":"&nbsp;","links":[]},{"id":"M1066","name":["Yvette Lisa Ndlovu"],"prog":["16"],"bio":"Yvette Lisa Ndlovu is a Zimbabwean sarungano (storyteller). Her debut short story collection <i>Swimming with Crocodiles<\/i> (University Press of Kentucky, Spring 2023) won the 2021 UPK New Poetry & Prose Series Prize. She is pursuing her MFA at the University of Massachusetts-Amherst where she teaches in the Writing Program. She has taught at Clarion West Writers Workshop online and earned her BA at Cornell University. Her work has been supported by fellowships from the Tin House Workshop, Bread Loaf Writers Workshop, and the New York State Summer Writers Institute. She received the 2017 Cornell University George Harmon Coxe Award for Poetry selected by Sally Wen Mao and was the 2020 fiction winner of Columbia Journal’s Womxn History Month Special Issue. She is the co-founder of the Voodoonauts Summer Workshop for Black SFF writers. Her work has appeared or is forthcoming in F&SF, Tor.com, Columbia Journal, Fiyah Literary Magazine, Mermaids Monthly, and Kweli Journal. She is currently at work on a novel.\n\n\nTwitter: <a href=\"https:\/\/twitter.com\/lisa_teabag\" target=\"_blank\">@lisa_teabag<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp27a05742ac2b267a2dcd553dd0bf6833.png"}},{"id":"M1068","name":["Dilman Dila"],"prog":["11","16","73"],"bio":"Dilman Dila is a writer, filmmaker, and all round artist who lives in his home country, Uganda. He is the author of a critically acclaimed collection of short stories, <em>A Killing in the Sun<\/em>. His two recent novellas are <em>The Future God of Love<\/em> and <em>A Fledgling Abiba<\/em>. He has been shortlisted for the BSFA Awards (2021) and for the Nommo Awards for Best Novella (2021), among many accolades. His short fiction have appeared in many anthologies, including the <em>Apex Book of World SF 4<\/em>. His films include the masterpiece <em>What Happened in Room 13<\/em> (2007) and <em>The Felistas Fable<\/em> (2013), which was nominated for Best First Feature by a Director at AMAA (2014). You can find his short films on <a href=\"https:\/\/patreon.com\/dilstories\" target=\"_blank\">patreon.com\/dilstories<\/a> and more about him on his website <a href=\"https:\/\/dilmandila.com\" target=\"_blank\">dilmandila.com<\/a>.\n\nTwitter: <a href=\"https:\/\/twitter.com\/dilmandila\" target=\"_blank\">@dilmandila<\/a>\nYouTube: <a href=\"https:\/\/youtube.com\/dilstories\" target=\"_blank\">dilstories<\/a>","links":[]},{"id":"M1069","name":["Casey Explosion"],"prog":["85"],"bio":"Casey's an Irish twitch streamer and gaming personality.\n\nTwitter: <a href=\"https:\/\/twitter.com\/caseyexplosion\" target=\"_blank\">@caseyexplosion<\/a>\nTwitch: <a href=\"https:\/\/twitch.tv\/caseyexplosion\" target=\"_blank\">caseyexplosion<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp809ce2500025bb8b25cd57e93c7fd9f5.png"}},{"id":"M1070","name":["Gabriela Houston"],"prog":["74"],"bio":"Gabriela Houston was born and raised in Poland, brought up on a diet of mythologies and fairy tales.\nShe spent her summers in Mazury (a flatland of forests and lakes), exploring the woods, foraging with her family and animal-tracking with her grandfather. At night, she’d sneak out swimming which fuelled her imagination-nurturing awe for the natural world, a quality which seeps into her writing.\nAt nineteen, Gabriela moved to London to study English Literature and later obtained a Masters degree in literatures of modernity. Since then, Gabriela has worked for a trade publisher as an assistant editor and as a freelance writer for a tech and business website. Gabriela’s short stories have been selected for the Editor’s Choice Review by <em>Bewildering Stories<\/em> and have been featured on the <em>Ladies of Horror Fiction<\/em> podcast.\nGabriela’s debut novel, <em>The Second Bell<\/em>, which was inspired by the Slavic folklore and landscapes of her childhood, was sold to Angry Robot, and published in March 2021. Gabriela’s debut book for younger readers, <em>The Wind Child<\/em> was sold to UCLan publishing and will be published in February 2022.\nShe cohosts a YouTube Channel, Bookish Take with a fellow author, Caroline Hardaker.\nShe lives in London with her husband and two children.\n\nLinktree: <a href=\"https:\/\/linktr.ee\/Gabriela_Houston\" target=\"_blank\">linktr.ee\/Gabriela_Houston<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp5abfef52c01eeb13c87865ef48aed6df.jpg"}},{"id":"M1071","name":["Patricia Jackson"],"prog":["112"],"bio":"Patricia A. Jackson is a high school Language Arts teacher in Pennsylvania. Her debut novel, <em>Forging A Nightmare<\/em>, an urban fantasy, is due out November 2021 from Angry Robot Books. \n\nShe has also published a number of short stories in the Star Wars Universe for the WestEnd Games quarterly <em>Star Wars Adventure Journal<\/em>. Her best known works are <em>Black Sands of Socorro<\/em>, a smugglers’ sourcebook about people of color for Star Wars: The Role-Playing Game, and <em>The Final Exit<\/em>, a short story about a dark Jedi’s redemption.\n\nWhen not writing, she’s gaming. Her favorite pastimes being Witcher III, Dragon Age, and Mass Effect. If she’s not grading an endless pile of flash fiction from students, Patricia runs a Dungeons & Dragons club at her high school to promote the next generation of players and writes fanfiction for her favorite Japanese anime, Psycho Pass. In her spare time, she rides horses and trains for dressage and hunter\/jumper competition.\n\nLinktree:  <a href=\"https:\/\/linktr.ee\/ByBirthright\" target=\"_blank\">https:\/\/linktr.ee\/ByBirthright<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppaf39330e6cf220c0ae5cebbc7b941876.jpg"}},{"id":"M1072","name":["Calder Szewczak"],"prog":["111"],"bio":"Calder Szewczak is writing duo Natasha C. Calder and Emma Szewczak, who met while studying at Cambridge University, UK. Their debut novel, <em>The Offset<\/em>, was published in September 2021 by Angry Robot and asks what it means to have children in a climate crisis. Their pronouns are she\/her.\n\nTwitter: <a href=\"https:\/\/twitter.com\/calderszewczak\" target=\"_blank\">@calderszewczak<\/a> and <a href=\"https:\/\/twitter.com\/emmaszewczak\" target=\"_blank\">@emmaszewczak<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppe241471f8d2a3367b0c606cb3f850eea.jpg"}},{"id":"M1073","name":["Ade Beattie"],"prog":["8"],"bio":"&nbsp; &nbsp;","links":[]},{"id":"M1074","name":["Stephen Deas"],"prog":["116"],"bio":"Stephen was brought up in a town full of retired colonels. His early memories largely consist of running around building sites and being able to spell ‘colonel’ at an unusually early age. Like most people of that age, he took to making up imaginary friends to supplement my real ones. Unlike most people, he never quite stopped, and has been writing about them in one form or another ever since.\nStephen is the author of more than twenty novels covering fantasy, crime, science fiction and historical fiction. He is best known for his <em>Memory of Flames<\/em> series, and has currently returned to fantasy with <em>The Moonsteel Crown<\/em> and the forthcoming <em>House of Cats and Gulls<\/em> for Angry Robot.\n\nAs well as his novel works, Stephen is currently collaborating on bringing a post-apocalyptic version of Robin Hood to the small screen and desperately trying to convince Netflix that what the world really needs is a show centred on Irene Adler.","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/pp01a642f4b9d27ee58d64fe30ed26f634.png"}},{"id":"M1075","name":["Elaine Lithgow"],"prog":["75"],"bio":"Elaine Lithgow is a Producer at <a href=\"https:\/\/www.cubicle7games.com\/\" target=\"_blank\">Cubicle 7<\/a>, currently working on the <em>Warhammer: Age of Sigmar<\/em> and <em>Warhammer: 40,000<\/em> tabletop roleplaying licences from Games Workshop. She studied Games Design and Production management at university, and has since worked on video games, board games and now tabletop games. She loves writing epic adventures with larger than life characters, as well as the odd foray into the murky waters of grimdark and horror. When she isn't writing, she can be found delving into digital dungeons or consuming fiction at a frankly alarming rate, all in the name of 'research'.\n\nTwitter: <a href=\"https:\/\/twitter.com\/cubicle7\" target=\"_blank\">@cubicle7<\/a>\nFacebook: <a href=\"https:\/\/www.facebook.com\/Cubicle7Entertainment\/\" target=\"_blank\">Cubicle7Entertainment<\/a>\nInstagram: <a href=\"https:\/\/www.instagram.com\/cubicle7\/\" target=\"_blank\">cubicle7<\/a>","links":{"img":"https:\/\/zambia.octocon.com\/\/participant_photos\/ppd284d0bdb548a4e5d2d262e3efc74bcd.png"}}];
